rusefi/rusefi/firmware/config/boards/cypress/OS/os/common/ext/CMSIS/S6E2CxAH/s6e2c5xh.h
typedef struct stc_can_brper_field
{
    union {
        struct {
            __IO  uint16_t  BRPE                 :4;
            __IO  uint16_t  RESERVED0            :12;
        };
        struct {
            __IO  uint16_t  BRPE0                :1;
            __IO  uint16_t  BRPE1                :1;
            __IO  uint16_t  BRPE2                :1;
            __IO  uint16_t  BRPE3                :1;
            __IO  uint16_t  RESERVED1            :12;
        };
    };
} stc_can_brper_field_t;

typedef struct stc_can_if1creq_field
{
    union {
        struct {
            __IO  uint16_t  MESSAGENUMBER        :8;
            __IO  uint16_t  RESERVED0            :7;
            __IO  uint16_t  BUSY                 :1;
        };
        struct {
            __IO  uint16_t  MESSAGENUMBER0       :1;
            __IO  uint16_t  MESSAGENUMBER1       :1;
            __IO  uint16_t  MESSAGENUMBER2       :1;
            __IO  uint16_t  MESSAGENUMBER3       :1;
            __IO  uint16_t  MESSAGENUMBER4       :1;
            __IO  uint16_t  MESSAGENUMBER5       :1;
            __IO  uint16_t  MESSAGENUMBER6       :1;
            __IO  uint16_t  MESSAGENUMBER7       :1;
            __IO  uint16_t  RESERVED1            :8;
        };
    };
} stc_can_if1creq_field_t;

typedef struct stc_can_if1cmsk_field
{
        __IO  uint16_t  DATAB                    :1;
        __IO  uint16_t  DATAA                    :1;
        __IO  uint16_t  NEWDAT                   :1;
        __IO  uint16_t  CIP                      :1;
        __IO  uint16_t  CONTROL                  :1;
        __IO  uint16_t  ARB                      :1;
        __IO  uint16_t  MASK                     :1;
        __IO  uint16_t  WR_RD                    :1;
        __IO  uint16_t  RESERVED0                :8;
} stc_can_if1cmsk_field_t;

typedef struct stc_can_if1msk_field
{
    union {
        struct {
            __IO  uint32_t  MSK                  :29;
            __IO  uint32_t  RESERVED0            :1;
            __IO  uint32_t  MDIR                 :1;
            __IO  uint32_t  MXTD                 :1;
        };
        struct {
            __IO  uint32_t  MSK0                 :1;
            __IO  uint32_t  MSK1                 :1;
            __IO  uint32_t  MSK2                 :1;
            __IO  uint32_t  MSK3                 :1;
            __IO  uint32_t  MSK4                 :1;
            __IO  uint32_t  MSK5                 :1;
            __IO  uint32_t  MSK6                 :1;
            __IO  uint32_t  MSK7                 :1;
            __IO  uint32_t  MSK8                 :1;
            __IO  uint32_t  MSK9                 :1;
            __IO  uint32_t  MSK10                :1;
            __IO  uint32_t  MSK11                :1;
            __IO  uint32_t  MSK12                :1;
            __IO  uint32_t  MSK13                :1;
            __IO  uint32_t  MSK14                :1;
            __IO  uint32_t  MSK15                :1;
            __IO  uint32_t  MSK16                :1;
            __IO  uint32_t  MSK17                :1;
            __IO  uint32_t  MSK18                :1;
            __IO  uint32_t  MSK19                :1;
            __IO  uint32_t  MSK20                :1;
            __IO  uint32_t  MSK21                :1;
            __IO  uint32_t  MSK22                :1;
            __IO  uint32_t  MSK23                :1;
            __IO  uint32_t  MSK24                :1;
            __IO  uint32_t  MSK25                :1;
            __IO  uint32_t  MSK26                :1;
            __IO  uint32_t  MSK27                :1;
            __IO  uint32_t  MSK28                :1;
            __IO  uint32_t  RESERVED1            :3;
        };
    };
} stc_can_if1msk_field_t;

typedef struct stc_can_if1arb_field
{
    union {
        struct {
            __IO  uint32_t  ID                   :29;
            __IO  uint32_t  DIR                  :1;
            __IO  uint32_t  XTD                  :1;
            __IO  uint32_t  MSGVAL               :1;
        };
        struct {
            __IO  uint32_t  ID0                  :1;
            __IO  uint32_t  ID1                  :1;
            __IO  uint32_t  ID2                  :1;
            __IO  uint32_t  ID3                  :1;
            __IO  uint32_t  ID4                  :1;
            __IO  uint32_t  ID5                  :1;
            __IO  uint32_t  ID6                  :1;
            __IO  uint32_t  ID7                  :1;
            __IO  uint32_t  ID8                  :1;
            __IO  uint32_t  ID9                  :1;
            __IO  uint32_t  ID10                 :1;
            __IO  uint32_t  ID11                 :1;
            __IO  uint32_t  ID12                 :1;
            __IO  uint32_t  ID13                 :1;
            __IO  uint32_t  ID14                 :1;
            __IO  uint32_t  ID15                 :1;
            __IO  uint32_t  ID16                 :1;
            __IO  uint32_t  ID17                 :1;
            __IO  uint32_t  ID18                 :1;
            __IO  uint32_t  ID19                 :1;
            __IO  uint32_t  ID20                 :1;
            __IO  uint32_t  ID21                 :1;
            __IO  uint32_t  ID22                 :1;
            __IO  uint32_t  ID23                 :1;
            __IO  uint32_t  ID24                 :1;
            __IO  uint32_t  ID25                 :1;
            __IO  uint32_t  ID26                 :1;
            __IO  uint32_t  ID27                 :1;
            __IO  uint32_t  ID28                 :1;
            __IO  uint32_t  RESERVED0            :3;
        };
    };
} stc_can_if1arb_field_t;

typedef struct stc_can_if1mctr_field
{
    union {
        struct {
            __IO  uint16_t  DLC                  :4;
            __IO  uint16_t  RESERVED0            :3;
            __IO  uint16_t  EOB                  :1;
            __IO  uint16_t  TXRQST               :1;
            __IO  uint16_t  RMTEN                :1;
            __IO  uint16_t  RXIE                 :1;
            __IO  uint16_t  TXIE                 :1;
            __IO  uint16_t  UMASK                :1;
            __IO  uint16_t  INTPND               :1;
            __IO  uint16_t  MSGLST               :1;
            __IO  uint16_t  NEWDAT               :1;
        };
        struct {
            __IO  uint16_t  DLC0                 :1;
            __IO  uint16_t  DLC1                 :1;
            __IO  uint16_t  DLC2                 :1;
            __IO  uint16_t  DLC3                 :1;
            __IO  uint16_t  RESERVED1            :12;
        };
    };
} stc_can_if1mctr_field_t;

typedef struct stc_can_if1dta_l_field
{
    union {
        struct {
            __IO  uint32_t  DATA0                :8;
            __IO  uint32_t  DATA1                :8;
            __IO  uint32_t  DATA2                :8;
            __IO  uint32_t  DATA3                :8;
        };
        struct {
            __IO  uint32_t  DATA00               :1;
            __IO  uint32_t  DATA01               :1;
            __IO  uint32_t  DATA02               :1;
            __IO  uint32_t  DATA03               :1;
            __IO  uint32_t  DATA04               :1;
            __IO  uint32_t  DATA05               :1;
            __IO  uint32_t  DATA06               :1;
            __IO  uint32_t  DATA07               :1;
            __IO  uint32_t  DATA10               :1;
            __IO  uint32_t  DATA11               :1;
            __IO  uint32_t  DATA12               :1;
            __IO  uint32_t  DATA13               :1;
            __IO  uint32_t  DATA14               :1;
            __IO  uint32_t  DATA15               :1;
            __IO  uint32_t  DATA16               :1;
            __IO  uint32_t  DATA17               :1;
            __IO  uint32_t  DATA20               :1;
            __IO  uint32_t  DATA21               :1;
            __IO  uint32_t  DATA22               :1;
            __IO  uint32_t  DATA23               :1;
            __IO  uint32_t  DATA24               :1;
            __IO  uint32_t  DATA25               :1;
            __IO  uint32_t  DATA26               :1;
            __IO  uint32_t  DATA27               :1;
            __IO  uint32_t  DATA30               :1;
            __IO  uint32_t  DATA31               :1;
            __IO  uint32_t  DATA32               :1;
            __IO  uint32_t  DATA33               :1;
            __IO  uint32_t  DATA34               :1;
            __IO  uint32_t  DATA35               :1;
            __IO  uint32_t  DATA36               :1;
            __IO  uint32_t  DATA37               :1;
        };
    };
} stc_can_if1dta_l_field_t;

typedef struct stc_can_if1dtb_l_field
{
    union {
        struct {
            __IO  uint32_t  DATA4                :8;
            __IO  uint32_t  DATA5                :8;
            __IO  uint32_t  DATA6                :8;
            __IO  uint32_t  DATA7                :8;
        };
        struct {
            __IO  uint32_t  DATA40               :1;
            __IO  uint32_t  DATA41               :1;
            __IO  uint32_t  DATA42               :1;
            __IO  uint32_t  DATA43               :1;
            __IO  uint32_t  DATA44               :1;
            __IO  uint32_t  DATA45               :1;
            __IO  uint32_t  DATA46               :1;
            __IO  uint32_t  DATA47               :1;
            __IO  uint32_t  DATA50               :1;
            __IO  uint32_t  DATA51               :1;
            __IO  uint32_t  DATA52               :1;
            __IO  uint32_t  DATA53               :1;
            __IO  uint32_t  DATA54               :1;
            __IO  uint32_t  DATA55               :1;
            __IO  uint32_t  DATA56               :1;
            __IO  uint32_t  DATA57               :1;
            __IO  uint32_t  DATA60               :1;
            __IO  uint32_t  DATA61               :1;
            __IO  uint32_t  DATA62               :1;
            __IO  uint32_t  DATA63               :1;
            __IO  uint32_t  DATA64               :1;
            __IO  uint32_t  DATA65               :1;
            __IO  uint32_t  DATA66               :1;
            __IO  uint32_t  DATA67               :1;
            __IO  uint32_t  DATA70               :1;
            __IO  uint32_t  DATA71               :1;
            __IO  uint32_t  DATA72               :1;
            __IO  uint32_t  DATA73               :1;
            __IO  uint32_t  DATA74               :1;
            __IO  uint32_t  DATA75               :1;
            __IO  uint32_t  DATA76               :1;
            __IO  uint32_t  DATA77               :1;
        };
    };
} stc_can_if1dtb_l_field_t;

typedef struct stc_can_if1dta_b_field
{
    union {
        struct {
            __IO  uint32_t  DATA3                :8;
            __IO  uint32_t  DATA2                :8;
            __IO  uint32_t  DATA1                :8;
            __IO  uint32_t  DATA0                :8;
        };
        struct {
            __IO  uint32_t  DATA30               :1;
            __IO  uint32_t  DATA31               :1;
            __IO  uint32_t  DATA32               :1;
            __IO  uint32_t  DATA33               :1;
            __IO  uint32_t  DATA34               :1;
            __IO  uint32_t  DATA35               :1;
            __IO  uint32_t  DATA36               :1;
            __IO  uint32_t  DATA37               :1;
            __IO  uint32_t  DATA20               :1;
            __IO  uint32_t  DATA21               :1;
            __IO  uint32_t  DATA22               :1;
            __IO  uint32_t  DATA23               :1;
            __IO  uint32_t  DATA24               :1;
            __IO  uint32_t  DATA25               :1;
            __IO  uint32_t  DATA26               :1;
            __IO  uint32_t  DATA27               :1;
            __IO  uint32_t  DATA10               :1;
            __IO  uint32_t  DATA11               :1;
            __IO  uint32_t  DATA12               :1;
            __IO  uint32_t  DATA13               :1;
            __IO  uint32_t  DATA14               :1;
            __IO  uint32_t  DATA15               :1;
            __IO  uint32_t  DATA16               :1;
            __IO  uint32_t  DATA17               :1;
            __IO  uint32_t  DATA00               :1;
            __IO  uint32_t  DATA01               :1;
            __IO  uint32_t  DATA02               :1;
            __IO  uint32_t  DATA03               :1;
            __IO  uint32_t  DATA04               :1;
            __IO  uint32_t  DATA05               :1;
            __IO  uint32_t  DATA06               :1;
            __IO  uint32_t  DATA07               :1;
        };
    };
} stc_can_if1dta_b_field_t;

typedef struct stc_can_if1dtb_b_field
{
    union {
        struct {
            __IO  uint32_t  DATA7                :8;
            __IO  uint32_t  DATA6                :8;
            __IO  uint32_t  DATA5                :8;
            __IO  uint32_t  DATA4                :8;
        };
        struct {
            __IO  uint32_t  DATA70               :1;
            __IO  uint32_t  DATA71               :1;
            __IO  uint32_t  DATA72               :1;
            __IO  uint32_t  DATA73               :1;
            __IO  uint32_t  DATA74               :1;
            __IO  uint32_t  DATA75               :1;
            __IO  uint32_t  DATA76               :1;
            __IO  uint32_t  DATA77               :1;
            __IO  uint32_t  DATA60               :1;
            __IO  uint32_t  DATA61               :1;
            __IO  uint32_t  DATA62               :1;
            __IO  uint32_t  DATA63               :1;
            __IO  uint32_t  DATA64               :1;
            __IO  uint32_t  DATA65               :1;
            __IO  uint32_t  DATA66               :1;
            __IO  uint32_t  DATA67               :1;
            __IO  uint32_t  DATA50               :1;
            __IO  uint32_t  DATA51               :1;
            __IO  uint32_t  DATA52               :1;
            __IO  uint32_t  DATA53               :1;
            __IO  uint32_t  DATA54               :1;
            __IO  uint32_t  DATA55               :1;
            __IO  uint32_t  DATA56               :1;
            __IO  uint32_t  DATA57               :1;
            __IO  uint32_t  DATA40               :1;
            __IO  uint32_t  DATA41               :1;
            __IO  uint32_t  DATA42               :1;
            __IO  uint32_t  DATA43               :1;
            __IO  uint32_t  DATA44               :1;
            __IO  uint32_t  DATA45               :1;
            __IO  uint32_t  DATA46               :1;
            __IO  uint32_t  DATA47               :1;
        };
    };
} stc_can_if1dtb_b_field_t;

typedef struct stc_can_if2creq_field
{
    union {
        struct {
            __IO  uint16_t  MESSAGENUMBER        :8;
            __IO  uint16_t  RESERVED0            :7;
            __IO  uint16_t  BUSY                 :1;
        };
        struct {
            __IO  uint16_t  MESSAGENUMBER0       :1;
            __IO  uint16_t  MESSAGENUMBER1       :1;
            __IO  uint16_t  MESSAGENUMBER2       :1;
            __IO  uint16_t  MESSAGENUMBER3       :1;
            __IO  uint16_t  MESSAGENUMBER4       :1;
            __IO  uint16_t  MESSAGENUMBER5       :1;
            __IO  uint16_t  MESSAGENUMBER6       :1;
            __IO  uint16_t  MESSAGENUMBER7       :1;
            __IO  uint16_t  RESERVED1            :8;
        };
    };
} stc_can_if2creq_field_t;

typedef struct stc_can_if2cmsk_field
{
        __IO  uint16_t  DATAB                    :1;
        __IO  uint16_t  DATAA                    :1;
        __IO  uint16_t  NEWDAT                   :1;
        __IO  uint16_t  CIP                      :1;
        __IO  uint16_t  CONTROL                  :1;
        __IO  uint16_t  ARB                      :1;
        __IO  uint16_t  MASK                     :1;
        __IO  uint16_t  WR_RD                    :1;
        __IO  uint16_t  RESERVED0                :8;
} stc_can_if2cmsk_field_t;

typedef struct stc_can_if2msk_field
{
    union {
        struct {
            __IO  uint32_t  MSK                  :29;
            __IO  uint32_t  RESERVED0            :1;
            __IO  uint32_t  MDIR                 :1;
            __IO  uint32_t  MXTD                 :1;
        };
        struct {
            __IO  uint32_t  MSK0                 :1;
            __IO  uint32_t  MSK1                 :1;
            __IO  uint32_t  MSK2                 :1;
            __IO  uint32_t  MSK3                 :1;
            __IO  uint32_t  MSK4                 :1;
            __IO  uint32_t  MSK5                 :1;
            __IO  uint32_t  MSK6                 :1;
            __IO  uint32_t  MSK7                 :1;
            __IO  uint32_t  MSK8                 :1;
            __IO  uint32_t  MSK9                 :1;
            __IO  uint32_t  MSK10                :1;
            __IO  uint32_t  MSK11                :1;
            __IO  uint32_t  MSK12                :1;
            __IO  uint32_t  MSK13                :1;
            __IO  uint32_t  MSK14                :1;
            __IO  uint32_t  MSK15                :1;
            __IO  uint32_t  MSK16                :1;
            __IO  uint32_t  MSK17                :1;
            __IO  uint32_t  MSK18                :1;
            __IO  uint32_t  MSK19                :1;
            __IO  uint32_t  MSK20                :1;
            __IO  uint32_t  MSK21                :1;
            __IO  uint32_t  MSK22                :1;
            __IO  uint32_t  MSK23                :1;
            __IO  uint32_t  MSK24                :1;
            __IO  uint32_t  MSK25                :1;
            __IO  uint32_t  MSK26                :1;
            __IO  uint32_t  MSK27                :1;
            __IO  uint32_t  MSK28                :1;
            __IO  uint32_t  RESERVED1            :3;
        };
    };
} stc_can_if2msk_field_t;

typedef struct stc_can_if2arb_field
{
    union {
        struct {
            __IO  uint32_t  ID                   :29;
            __IO  uint32_t  DIR                  :1;
            __IO  uint32_t  XTD                  :1;
            __IO  uint32_t  MSGVAL               :1;
        };
        struct {
            __IO  uint32_t  ID0                  :1;
            __IO  uint32_t  ID1                  :1;
            __IO  uint32_t  ID2                  :1;
            __IO  uint32_t  ID3                  :1;
            __IO  uint32_t  ID4                  :1;
            __IO  uint32_t  ID5                  :1;
            __IO  uint32_t  ID6                  :1;
            __IO  uint32_t  ID7                  :1;
            __IO  uint32_t  ID8                  :1;
            __IO  uint32_t  ID9                  :1;
            __IO  uint32_t  ID10                 :1;
            __IO  uint32_t  ID11                 :1;
            __IO  uint32_t  ID12                 :1;
            __IO  uint32_t  ID13                 :1;
            __IO  uint32_t  ID14                 :1;
            __IO  uint32_t  ID15                 :1;
            __IO  uint32_t  ID16                 :1;
            __IO  uint32_t  ID17                 :1;
            __IO  uint32_t  ID18                 :1;
            __IO  uint32_t  ID19                 :1;
            __IO  uint32_t  ID20                 :1;
            __IO  uint32_t  ID21                 :1;
            __IO  uint32_t  ID22                 :1;
            __IO  uint32_t  ID23                 :1;
            __IO  uint32_t  ID24                 :1;
            __IO  uint32_t  ID25                 :1;
            __IO  uint32_t  ID26                 :1;
            __IO  uint32_t  ID27                 :1;
            __IO  uint32_t  ID28                 :1;
            __IO  uint32_t  RESERVED0            :3;
        };
    };
} stc_can_if2arb_field_t;

typedef struct stc_can_if2mctr_field
{
    union {
        struct {
            __IO  uint16_t  DLC                  :4;
            __IO  uint16_t  RESERVED0            :3;
            __IO  uint16_t  EOB                  :1;
            __IO  uint16_t  TXRQST               :1;
            __IO  uint16_t  RMTEN                :1;
            __IO  uint16_t  RXIE                 :1;
            __IO  uint16_t  TXIE                 :1;
            __IO  uint16_t  UMASK                :1;
            __IO  uint16_t  INTPND               :1;
            __IO  uint16_t  MSGLST               :1;
            __IO  uint16_t  NEWDAT               :1;
        };
        struct {
            __IO  uint16_t  DLC0                 :1;
            __IO  uint16_t  DLC1                 :1;
            __IO  uint16_t  DLC2                 :1;
            __IO  uint16_t  DLC3                 :1;
            __IO  uint16_t  RESERVED1            :12;
        };
    };
} stc_can_if2mctr_field_t;

typedef struct stc_can_if2dta_l_field
{
    union {
        struct {
            __IO  uint32_t  DATA0                :8;
            __IO  uint32_t  DATA1                :8;
            __IO  uint32_t  DATA2                :8;
            __IO  uint32_t  DATA3                :8;
        };
        struct {
            __IO  uint32_t  DATA00               :1;
            __IO  uint32_t  DATA01               :1;
            __IO  uint32_t  DATA02               :1;
            __IO  uint32_t  DATA03               :1;
            __IO  uint32_t  DATA04               :1;
            __IO  uint32_t  DATA05               :1;
            __IO  uint32_t  DATA06               :1;
            __IO  uint32_t  DATA07               :1;
            __IO  uint32_t  DATA10               :1;
            __IO  uint32_t  DATA11               :1;
            __IO  uint32_t  DATA12               :1;
            __IO  uint32_t  DATA13               :1;
            __IO  uint32_t  DATA14               :1;
            __IO  uint32_t  DATA15               :1;
            __IO  uint32_t  DATA16               :1;
            __IO  uint32_t  DATA17               :1;
            __IO  uint32_t  DATA20               :1;
            __IO  uint32_t  DATA21               :1;
            __IO  uint32_t  DATA22               :1;
            __IO  uint32_t  DATA23               :1;
            __IO  uint32_t  DATA24               :1;
            __IO  uint32_t  DATA25               :1;
            __IO  uint32_t  DATA26               :1;
            __IO  uint32_t  DATA27               :1;
            __IO  uint32_t  DATA30               :1;
            __IO  uint32_t  DATA31               :1;
            __IO  uint32_t  DATA32               :1;
            __IO  uint32_t  DATA33               :1;
            __IO  uint32_t  DATA34               :1;
            __IO  uint32_t  DATA35               :1;
            __IO  uint32_t  DATA36               :1;
            __IO  uint32_t  DATA37               :1;
        };
    };
} stc_can_if2dta_l_field_t;

