rusefi/rusefi/firmware/config/boards/cypress/OS/os/common/ext/CMSIS/S6E2CxAH/s6e2c5xh.h
typedef struct stc_can_if2dtb_l_field
{
    union {
        struct {
            __IO  uint32_t  DATA4                :8;
            __IO  uint32_t  DATA5                :8;
            __IO  uint32_t  DATA6                :8;
            __IO  uint32_t  DATA7                :8;
        };
        struct {
            __IO  uint32_t  DATA40               :1;
            __IO  uint32_t  DATA41               :1;
            __IO  uint32_t  DATA42               :1;
            __IO  uint32_t  DATA43               :1;
            __IO  uint32_t  DATA44               :1;
            __IO  uint32_t  DATA45               :1;
            __IO  uint32_t  DATA46               :1;
            __IO  uint32_t  DATA47               :1;
            __IO  uint32_t  DATA50               :1;
            __IO  uint32_t  DATA51               :1;
            __IO  uint32_t  DATA52               :1;
            __IO  uint32_t  DATA53               :1;
            __IO  uint32_t  DATA54               :1;
            __IO  uint32_t  DATA55               :1;
            __IO  uint32_t  DATA56               :1;
            __IO  uint32_t  DATA57               :1;
            __IO  uint32_t  DATA60               :1;
            __IO  uint32_t  DATA61               :1;
            __IO  uint32_t  DATA62               :1;
            __IO  uint32_t  DATA63               :1;
            __IO  uint32_t  DATA64               :1;
            __IO  uint32_t  DATA65               :1;
            __IO  uint32_t  DATA66               :1;
            __IO  uint32_t  DATA67               :1;
            __IO  uint32_t  DATA70               :1;
            __IO  uint32_t  DATA71               :1;
            __IO  uint32_t  DATA72               :1;
            __IO  uint32_t  DATA73               :1;
            __IO  uint32_t  DATA74               :1;
            __IO  uint32_t  DATA75               :1;
            __IO  uint32_t  DATA76               :1;
            __IO  uint32_t  DATA77               :1;
        };
    };
} stc_can_if2dtb_l_field_t;

typedef struct stc_can_if2dta_b_field
{
    union {
        struct {
            __IO  uint32_t  DATA3                :8;
            __IO  uint32_t  DATA2                :8;
            __IO  uint32_t  DATA1                :8;
            __IO  uint32_t  DATA0                :8;
        };
        struct {
            __IO  uint32_t  DATA30               :1;
            __IO  uint32_t  DATA31               :1;
            __IO  uint32_t  DATA32               :1;
            __IO  uint32_t  DATA33               :1;
            __IO  uint32_t  DATA34               :1;
            __IO  uint32_t  DATA35               :1;
            __IO  uint32_t  DATA36               :1;
            __IO  uint32_t  DATA37               :1;
            __IO  uint32_t  DATA20               :1;
            __IO  uint32_t  DATA21               :1;
            __IO  uint32_t  DATA22               :1;
            __IO  uint32_t  DATA23               :1;
            __IO  uint32_t  DATA24               :1;
            __IO  uint32_t  DATA25               :1;
            __IO  uint32_t  DATA26               :1;
            __IO  uint32_t  DATA27               :1;
            __IO  uint32_t  DATA10               :1;
            __IO  uint32_t  DATA11               :1;
            __IO  uint32_t  DATA12               :1;
            __IO  uint32_t  DATA13               :1;
            __IO  uint32_t  DATA14               :1;
            __IO  uint32_t  DATA15               :1;
            __IO  uint32_t  DATA16               :1;
            __IO  uint32_t  DATA17               :1;
            __IO  uint32_t  DATA00               :1;
            __IO  uint32_t  DATA01               :1;
            __IO  uint32_t  DATA02               :1;
            __IO  uint32_t  DATA03               :1;
            __IO  uint32_t  DATA04               :1;
            __IO  uint32_t  DATA05               :1;
            __IO  uint32_t  DATA06               :1;
            __IO  uint32_t  DATA07               :1;
        };
    };
} stc_can_if2dta_b_field_t;

typedef struct stc_can_if2dtb_b_field
{
    union {
        struct {
            __IO  uint32_t  DATA7                :8;
            __IO  uint32_t  DATA6                :8;
            __IO  uint32_t  DATA5                :8;
            __IO  uint32_t  DATA4                :8;
        };
        struct {
            __IO  uint32_t  DATA70               :1;
            __IO  uint32_t  DATA71               :1;
            __IO  uint32_t  DATA72               :1;
            __IO  uint32_t  DATA73               :1;
            __IO  uint32_t  DATA74               :1;
            __IO  uint32_t  DATA75               :1;
            __IO  uint32_t  DATA76               :1;
            __IO  uint32_t  DATA77               :1;
            __IO  uint32_t  DATA60               :1;
            __IO  uint32_t  DATA61               :1;
            __IO  uint32_t  DATA62               :1;
            __IO  uint32_t  DATA63               :1;
            __IO  uint32_t  DATA64               :1;
            __IO  uint32_t  DATA65               :1;
            __IO  uint32_t  DATA66               :1;
            __IO  uint32_t  DATA67               :1;
            __IO  uint32_t  DATA50               :1;
            __IO  uint32_t  DATA51               :1;
            __IO  uint32_t  DATA52               :1;
            __IO  uint32_t  DATA53               :1;
            __IO  uint32_t  DATA54               :1;
            __IO  uint32_t  DATA55               :1;
            __IO  uint32_t  DATA56               :1;
            __IO  uint32_t  DATA57               :1;
            __IO  uint32_t  DATA40               :1;
            __IO  uint32_t  DATA41               :1;
            __IO  uint32_t  DATA42               :1;
            __IO  uint32_t  DATA43               :1;
            __IO  uint32_t  DATA44               :1;
            __IO  uint32_t  DATA45               :1;
            __IO  uint32_t  DATA46               :1;
            __IO  uint32_t  DATA47               :1;
        };
    };
} stc_can_if2dtb_b_field_t;

typedef struct stc_can_treqr_field
{
        __IO  uint32_t  TXRQST1                  :1;
        __IO  uint32_t  TXRQST2                  :1;
        __IO  uint32_t  TXRQST3                  :1;
        __IO  uint32_t  TXRQST4                  :1;
        __IO  uint32_t  TXRQST5                  :1;
        __IO  uint32_t  TXRQST6                  :1;
        __IO  uint32_t  TXRQST7                  :1;
        __IO  uint32_t  TXRQST8                  :1;
        __IO  uint32_t  TXRQST9                  :1;
        __IO  uint32_t  TXRQST10                 :1;
        __IO  uint32_t  TXRQST11                 :1;
        __IO  uint32_t  TXRQST12                 :1;
        __IO  uint32_t  TXRQST13                 :1;
        __IO  uint32_t  TXRQST14                 :1;
        __IO  uint32_t  TXRQST15                 :1;
        __IO  uint32_t  TXRQST16                 :1;
        __IO  uint32_t  TXRQST17                 :1;
        __IO  uint32_t  TXRQST18                 :1;
        __IO  uint32_t  TXRQST19                 :1;
        __IO  uint32_t  TXRQST20                 :1;
        __IO  uint32_t  TXRQST21                 :1;
        __IO  uint32_t  TXRQST22                 :1;
        __IO  uint32_t  TXRQST23                 :1;
        __IO  uint32_t  TXRQST24                 :1;
        __IO  uint32_t  TXRQST25                 :1;
        __IO  uint32_t  TXRQST26                 :1;
        __IO  uint32_t  TXRQST27                 :1;
        __IO  uint32_t  TXRQST28                 :1;
        __IO  uint32_t  TXRQST29                 :1;
        __IO  uint32_t  TXRQST30                 :1;
        __IO  uint32_t  TXRQST31                 :1;
        __IO  uint32_t  TXRQST32                 :1;
} stc_can_treqr_field_t;

typedef struct stc_can_newdt_field
{
        __IO  uint32_t  NEWDAT1                  :1;
        __IO  uint32_t  NEWDAT2                  :1;
        __IO  uint32_t  NEWDAT3                  :1;
        __IO  uint32_t  NEWDAT4                  :1;
        __IO  uint32_t  NEWDAT5                  :1;
        __IO  uint32_t  NEWDAT6                  :1;
        __IO  uint32_t  NEWDAT7                  :1;
        __IO  uint32_t  NEWDAT8                  :1;
        __IO  uint32_t  NEWDAT9                  :1;
        __IO  uint32_t  NEWDAT10                 :1;
        __IO  uint32_t  NEWDAT11                 :1;
        __IO  uint32_t  NEWDAT12                 :1;
        __IO  uint32_t  NEWDAT13                 :1;
        __IO  uint32_t  NEWDAT14                 :1;
        __IO  uint32_t  NEWDAT15                 :1;
        __IO  uint32_t  NEWDAT16                 :1;
        __IO  uint32_t  NEWDAT17                 :1;
        __IO  uint32_t  NEWDAT18                 :1;
        __IO  uint32_t  NEWDAT19                 :1;
        __IO  uint32_t  NEWDAT20                 :1;
        __IO  uint32_t  NEWDAT21                 :1;
        __IO  uint32_t  NEWDAT22                 :1;
        __IO  uint32_t  NEWDAT23                 :1;
        __IO  uint32_t  NEWDAT24                 :1;
        __IO  uint32_t  NEWDAT25                 :1;
        __IO  uint32_t  NEWDAT26                 :1;
        __IO  uint32_t  NEWDAT27                 :1;
        __IO  uint32_t  NEWDAT28                 :1;
        __IO  uint32_t  NEWDAT29                 :1;
        __IO  uint32_t  NEWDAT30                 :1;
        __IO  uint32_t  NEWDAT31                 :1;
        __IO  uint32_t  NEWDAT32                 :1;
} stc_can_newdt_field_t;

typedef struct stc_can_intpnd_field
{
        __IO  uint32_t  INTPND1                  :1;
        __IO  uint32_t  INTPND2                  :1;
        __IO  uint32_t  INTPND3                  :1;
        __IO  uint32_t  INTPND4                  :1;
        __IO  uint32_t  INTPND5                  :1;
        __IO  uint32_t  INTPND6                  :1;
        __IO  uint32_t  INTPND7                  :1;
        __IO  uint32_t  INTPND8                  :1;
        __IO  uint32_t  INTPND9                  :1;
        __IO  uint32_t  INTPND10                 :1;
        __IO  uint32_t  INTPND11                 :1;
        __IO  uint32_t  INTPND12                 :1;
        __IO  uint32_t  INTPND13                 :1;
        __IO  uint32_t  INTPND14                 :1;
        __IO  uint32_t  INTPND15                 :1;
        __IO  uint32_t  INTPND16                 :1;
        __IO  uint32_t  INTPND17                 :1;
        __IO  uint32_t  INTPND18                 :1;
        __IO  uint32_t  INTPND19                 :1;
        __IO  uint32_t  INTPND20                 :1;
        __IO  uint32_t  INTPND21                 :1;
        __IO  uint32_t  INTPND22                 :1;
        __IO  uint32_t  INTPND23                 :1;
        __IO  uint32_t  INTPND24                 :1;
        __IO  uint32_t  INTPND25                 :1;
        __IO  uint32_t  INTPND26                 :1;
        __IO  uint32_t  INTPND27                 :1;
        __IO  uint32_t  INTPND28                 :1;
        __IO  uint32_t  INTPND29                 :1;
        __IO  uint32_t  INTPND30                 :1;
        __IO  uint32_t  INTPND31                 :1;
        __IO  uint32_t  INTPND32                 :1;
} stc_can_intpnd_field_t;

