rusefi/rusefi/firmware/config/boards/cypress/OS/os/common/ext/CMSIS/S6E2CxAH/s6e2c5xh.h
typedef struct stc_can_msgval_field
{
        __IO  uint32_t  MSGVAL1                  :1;
        __IO  uint32_t  MSGVAL2                  :1;
        __IO  uint32_t  MSGVAL3                  :1;
        __IO  uint32_t  MSGVAL4                  :1;
        __IO  uint32_t  MSGVAL5                  :1;
        __IO  uint32_t  MSGVAL6                  :1;
        __IO  uint32_t  MSGVAL7                  :1;
        __IO  uint32_t  MSGVAL8                  :1;
        __IO  uint32_t  MSGVAL9                  :1;
        __IO  uint32_t  MSGVAL10                 :1;
        __IO  uint32_t  MSGVAL11                 :1;
        __IO  uint32_t  MSGVAL12                 :1;
        __IO  uint32_t  MSGVAL13                 :1;
        __IO  uint32_t  MSGVAL14                 :1;
        __IO  uint32_t  MSGVAL15                 :1;
        __IO  uint32_t  MSGVAL16                 :1;
        __IO  uint32_t  MSGVAL17                 :1;
        __IO  uint32_t  MSGVAL18                 :1;
        __IO  uint32_t  MSGVAL19                 :1;
        __IO  uint32_t  MSGVAL20                 :1;
        __IO  uint32_t  MSGVAL21                 :1;
        __IO  uint32_t  MSGVAL22                 :1;
        __IO  uint32_t  MSGVAL23                 :1;
        __IO  uint32_t  MSGVAL24                 :1;
        __IO  uint32_t  MSGVAL25                 :1;
        __IO  uint32_t  MSGVAL26                 :1;
        __IO  uint32_t  MSGVAL27                 :1;
        __IO  uint32_t  MSGVAL28                 :1;
        __IO  uint32_t  MSGVAL29                 :1;
        __IO  uint32_t  MSGVAL30                 :1;
        __IO  uint32_t  MSGVAL31                 :1;
        __IO  uint32_t  MSGVAL32                 :1;
} stc_can_msgval_field_t;

/*******************************************************************************
* CANFD_MODULE
*******************************************************************************/
typedef struct stc_canfd_crel_field
{
    union {
        struct {
            __IO  uint32_t  DAY                  :8;
            __IO  uint32_t  MON                  :8;
            __IO  uint32_t  YEAR                 :4;
            __IO  uint32_t  SUBSTEP              :4;
            __IO  uint32_t  STEP                 :4;
            __IO  uint32_t  REL                  :4;
        };
        struct {
            __IO  uint32_t  DAY0                 :1;
            __IO  uint32_t  DAY1                 :1;
            __IO  uint32_t  DAY2                 :1;
            __IO  uint32_t  DAY3                 :1;
            __IO  uint32_t  DAY4                 :1;
            __IO  uint32_t  DAY5                 :1;
            __IO  uint32_t  DAY6                 :1;
            __IO  uint32_t  DAY7                 :1;
            __IO  uint32_t  MON0                 :1;
            __IO  uint32_t  MON1                 :1;
            __IO  uint32_t  MON2                 :1;
            __IO  uint32_t  MON3                 :1;
            __IO  uint32_t  MON4                 :1;
            __IO  uint32_t  MON5                 :1;
            __IO  uint32_t  MON6                 :1;
            __IO  uint32_t  MON7                 :1;
            __IO  uint32_t  YEAR0                :1;
            __IO  uint32_t  YEAR1                :1;
            __IO  uint32_t  YEAR2                :1;
            __IO  uint32_t  YEAR3                :1;
            __IO  uint32_t  SUBSTEP0             :1;
            __IO  uint32_t  SUBSTEP1             :1;
            __IO  uint32_t  SUBSTEP2             :1;
            __IO  uint32_t  SUBSTEP3             :1;
            __IO  uint32_t  STEP0                :1;
            __IO  uint32_t  STEP1                :1;
            __IO  uint32_t  STEP2                :1;
            __IO  uint32_t  STEP3                :1;
            __IO  uint32_t  REL0                 :1;
            __IO  uint32_t  REL1                 :1;
            __IO  uint32_t  REL2                 :1;
            __IO  uint32_t  REL3                 :1;
        };
    };
} stc_canfd_crel_field_t;

typedef struct stc_canfd_endn_field
{
    union {
        struct {
            __IO  uint32_t  ETV                  :32;
        };
        struct {
            __IO  uint32_t  ETV0                 :1;
            __IO  uint32_t  ETV1                 :1;
            __IO  uint32_t  ETV2                 :1;
            __IO  uint32_t  ETV3                 :1;
            __IO  uint32_t  ETV4                 :1;
            __IO  uint32_t  ETV5                 :1;
            __IO  uint32_t  ETV6                 :1;
            __IO  uint32_t  ETV7                 :1;
            __IO  uint32_t  ETV8                 :1;
            __IO  uint32_t  ETV9                 :1;
            __IO  uint32_t  ETV10                :1;
            __IO  uint32_t  ETV11                :1;
            __IO  uint32_t  ETV12                :1;
            __IO  uint32_t  ETV13                :1;
            __IO  uint32_t  ETV14                :1;
            __IO  uint32_t  ETV15                :1;
            __IO  uint32_t  ETV16                :1;
            __IO  uint32_t  ETV17                :1;
            __IO  uint32_t  ETV18                :1;
            __IO  uint32_t  ETV19                :1;
            __IO  uint32_t  ETV20                :1;
            __IO  uint32_t  ETV21                :1;
            __IO  uint32_t  ETV22                :1;
            __IO  uint32_t  ETV23                :1;
            __IO  uint32_t  ETV24                :1;
            __IO  uint32_t  ETV25                :1;
            __IO  uint32_t  ETV26                :1;
            __IO  uint32_t  ETV27                :1;
            __IO  uint32_t  ETV28                :1;
            __IO  uint32_t  ETV29                :1;
            __IO  uint32_t  ETV30                :1;
            __IO  uint32_t  ETV31                :1;
        };
    };
} stc_canfd_endn_field_t;

typedef struct stc_canfd_fbtp_field
{
    union {
        struct {
            __IO  uint32_t  FSJW                 :2;
            __IO  uint32_t  RESERVED0            :2;
            __IO  uint32_t  FTSEG2               :3;
            __IO  uint32_t  RESERVED2            :1;
            __IO  uint32_t  FTSEG1               :4;
            __IO  uint32_t  RESERVED4            :4;
            __IO  uint32_t  FBRP                 :5;
            __IO  uint32_t  RESERVED6            :2;
            __IO  uint32_t  TDC                  :1;
            __IO  uint32_t  TDCO                 :5;
            __IO  uint32_t  RESERVED8            :3;
        };
        struct {
            __IO  uint32_t  FSJW0                :1;
            __IO  uint32_t  FSJW1                :1;
            __IO  uint32_t  RESERVED1            :2;
            __IO  uint32_t  FTSEG20              :1;
            __IO  uint32_t  FTSEG21              :1;
            __IO  uint32_t  FTSEG22              :1;
            __IO  uint32_t  RESERVED3            :1;
            __IO  uint32_t  FTSEG10              :1;
            __IO  uint32_t  FTSEG11              :1;
            __IO  uint32_t  FTSEG12              :1;
            __IO  uint32_t  FTSEG13              :1;
            __IO  uint32_t  RESERVED5            :4;
            __IO  uint32_t  FBRP0                :1;
            __IO  uint32_t  FBRP1                :1;
            __IO  uint32_t  FBRP2                :1;
            __IO  uint32_t  FBRP3                :1;
            __IO  uint32_t  FBRP4                :1;
            __IO  uint32_t  RESERVED7            :3;
            __IO  uint32_t  TDCO0                :1;
            __IO  uint32_t  TDCO1                :1;
            __IO  uint32_t  TDCO2                :1;
            __IO  uint32_t  TDCO3                :1;
            __IO  uint32_t  TDCO4                :1;
            __IO  uint32_t  RESERVED9            :3;
        };
    };
} stc_canfd_fbtp_field_t;

typedef struct stc_canfd_test_field
{
    union {
        struct {
            __IO  uint32_t  RESERVED0            :4;
            __IO  uint32_t  LBCK                 :1;
            __IO  uint32_t  TX                   :2;
            __IO  uint32_t  RX                   :1;
            __IO  uint32_t  TDCV                 :6;
            __IO  uint32_t  RESERVED3            :18;
        };
        struct {
            __IO  uint32_t  RESERVED1            :5;
            __IO  uint32_t  TX0                  :1;
            __IO  uint32_t  TX1                  :1;
            __IO  uint32_t  RESERVED2            :1;
            __IO  uint32_t  TDCV0                :1;
            __IO  uint32_t  TDCV1                :1;
            __IO  uint32_t  TDCV2                :1;
            __IO  uint32_t  TDCV3                :1;
            __IO  uint32_t  TDCV4                :1;
            __IO  uint32_t  TDCV5                :1;
            __IO  uint32_t  RESERVED4            :18;
        };
    };
} stc_canfd_test_field_t;

typedef struct stc_canfd_rwd_field
{
    union {
        struct {
            __IO  uint32_t  WDC                  :8;
            __IO  uint32_t  WDV                  :8;
            __IO  uint32_t  RESERVED0            :16;
        };
        struct {
            __IO  uint32_t  WDC0                 :1;
            __IO  uint32_t  WDC1                 :1;
            __IO  uint32_t  WDC2                 :1;
            __IO  uint32_t  WDC3                 :1;
            __IO  uint32_t  WDC4                 :1;
            __IO  uint32_t  WDC5                 :1;
            __IO  uint32_t  WDC6                 :1;
            __IO  uint32_t  WDC7                 :1;
            __IO  uint32_t  WDV0                 :1;
            __IO  uint32_t  WDV1                 :1;
            __IO  uint32_t  WDV2                 :1;
            __IO  uint32_t  WDV3                 :1;
            __IO  uint32_t  WDV4                 :1;
            __IO  uint32_t  WDV5                 :1;
            __IO  uint32_t  WDV6                 :1;
            __IO  uint32_t  WDV7                 :1;
            __IO  uint32_t  RESERVED1            :16;
        };
    };
} stc_canfd_rwd_field_t;

