rusefi/rusefi/firmware/config/boards/cypress/OS/os/common/ext/CMSIS/S6E2CxAH/s6e2c5xh.h
            };
          };
        };
    };
    union {
        __IO uint32_t CSITIME;
        stc_hsspi_csitime_field_t CSITIME_f;
        struct {
          union {
            __IO uint16_t CSITIMEL;
            struct {
              __IO uint8_t CSITIMELL;
              __IO uint8_t CSITIMELH;
            };
          };
          union {
            __IO uint16_t CSITIMEH;
            struct {
              __IO uint8_t CSITIMEHL;
              __IO uint8_t CSITIMEHH;
            };
          };
        };
    };
    union {
        __IO uint32_t CSAEXT;
        stc_hsspi_csaext_field_t CSAEXT_f;
        struct {
          union {
            __IO uint16_t CSAEXTL;
            struct {
              __IO uint8_t CSAEXTLL;
              __IO uint8_t CSAEXTLH;
            };
          };
          union {
            __IO uint16_t CSAEXTH;
            struct {
              __IO uint8_t CSAEXTHL;
              __IO uint8_t CSAEXTHH;
            };
          };
        };
    };
    union {
        __IO uint16_t RDCSDC0;
        stc_hsspi_rdcsdc0_field_t RDCSDC0_f;
        struct {
            __IO  uint8_t RDCSDC0L;
            __IO  uint8_t RDCSDC0H;
        };
    };
    union {
        __IO uint16_t RDCSDC1;
        stc_hsspi_rdcsdc1_field_t RDCSDC1_f;
        struct {
            __IO  uint8_t RDCSDC1L;
            __IO  uint8_t RDCSDC1H;
        };
    };
    union {
        __IO uint16_t RDCSDC2;
        stc_hsspi_rdcsdc2_field_t RDCSDC2_f;
        struct {
            __IO  uint8_t RDCSDC2L;
            __IO  uint8_t RDCSDC2H;
        };
    };
    union {
        __IO uint16_t RDCSDC3;
        stc_hsspi_rdcsdc3_field_t RDCSDC3_f;
        struct {
            __IO  uint8_t RDCSDC3L;
            __IO  uint8_t RDCSDC3H;
        };
    };
    union {
        __IO uint16_t RDCSDC4;
        stc_hsspi_rdcsdc4_field_t RDCSDC4_f;
        struct {
            __IO  uint8_t RDCSDC4L;
            __IO  uint8_t RDCSDC4H;
        };
    };
    union {
        __IO uint16_t RDCSDC5;
        stc_hsspi_rdcsdc5_field_t RDCSDC5_f;
        struct {
            __IO  uint8_t RDCSDC5L;
            __IO  uint8_t RDCSDC5H;
        };
    };
    union {
        __IO uint16_t RDCSDC6;
        stc_hsspi_rdcsdc6_field_t RDCSDC6_f;
        struct {
            __IO  uint8_t RDCSDC6L;
            __IO  uint8_t RDCSDC6H;
        };
    };
    union {
        __IO uint16_t RDCSDC7;
        stc_hsspi_rdcsdc7_field_t RDCSDC7_f;
        struct {
            __IO  uint8_t RDCSDC7L;
            __IO  uint8_t RDCSDC7H;
        };
    };
    union {
        __IO uint16_t WRCSDC0;
        stc_hsspi_wrcsdc0_field_t WRCSDC0_f;
        struct {
            __IO  uint8_t WRCSDC0L;
            __IO  uint8_t WRCSDC0H;
        };
    };
    union {
        __IO uint16_t WRCSDC1;
        stc_hsspi_wrcsdc1_field_t WRCSDC1_f;
        struct {
            __IO  uint8_t WRCSDC1L;
            __IO  uint8_t WRCSDC1H;
        };
    };
    union {
        __IO uint16_t WRCSDC2;
        stc_hsspi_wrcsdc2_field_t WRCSDC2_f;
        struct {
            __IO  uint8_t WRCSDC2L;
            __IO  uint8_t WRCSDC2H;
        };
    };
    union {
        __IO uint16_t WRCSDC3;
        stc_hsspi_wrcsdc3_field_t WRCSDC3_f;
        struct {
            __IO  uint8_t WRCSDC3L;
            __IO  uint8_t WRCSDC3H;
        };
    };
    union {
        __IO uint16_t WRCSDC4;
        stc_hsspi_wrcsdc4_field_t WRCSDC4_f;
        struct {
            __IO  uint8_t WRCSDC4L;
            __IO  uint8_t WRCSDC4H;
        };
    };
    union {
        __IO uint16_t WRCSDC5;
        stc_hsspi_wrcsdc5_field_t WRCSDC5_f;
        struct {
            __IO  uint8_t WRCSDC5L;
            __IO  uint8_t WRCSDC5H;
        };
    };
    union {
        __IO uint16_t WRCSDC6;
        stc_hsspi_wrcsdc6_field_t WRCSDC6_f;
        struct {
            __IO  uint8_t WRCSDC6L;
            __IO  uint8_t WRCSDC6H;
        };
    };
    union {
        __IO uint16_t WRCSDC7;
        stc_hsspi_wrcsdc7_field_t WRCSDC7_f;
        struct {
            __IO  uint8_t WRCSDC7L;
            __IO  uint8_t WRCSDC7H;
        };
    };
    union {
        __IO uint32_t MID;
        stc_hsspi_mid_field_t MID_f;
        struct {
          union {
            __IO uint16_t MIDL;
            struct {
              __IO uint8_t MIDLL;
              __IO uint8_t MIDLH;
            };
          };
          union {
            __IO uint16_t MIDH;
            struct {
              __IO uint8_t MIDHL;
              __IO uint8_t MIDHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED2[768];
    union {
        __IO  uint8_t QDCLKR;
        stc_hsspi_qdclkr_field_t QDCLKR_f;
    };
        __IO  uint8_t RESERVED3[3];
    union {
        __IO  uint8_t DBCNT;
        stc_hsspi_dbcnt_field_t DBCNT_f;
    };
} FM_HSSPI_TypeDef, FM4_HSSPI_TypeDef;

/*******************************************************************************
* HWWDT_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t WDG_LDR;
        struct {
          union {
            __IO uint16_t WDG_LDRL;
            struct {
              __IO uint8_t WDG_LDRLL;
              __IO uint8_t WDG_LDRLH;
            };
          };
          union {
            __IO uint16_t WDG_LDRH;
            struct {
              __IO uint8_t WDG_LDRHL;
              __IO uint8_t WDG_LDRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WDG_VLR;
        struct {
          union {
            __IO uint16_t WDG_VLRL;
            struct {
              __IO uint8_t WDG_VLRLL;
              __IO uint8_t WDG_VLRLH;
            };
          };
          union {
            __IO uint16_t WDG_VLRH;
            struct {
              __IO uint8_t WDG_VLRHL;
              __IO uint8_t WDG_VLRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WDG_CTL;
        stc_hwwdt_wdg_ctl_field_t WDG_CTL_f;
        struct {
          union {
            __IO uint16_t WDG_CTLL;
            struct {
              __IO uint8_t WDG_CTLLL;
              __IO uint8_t WDG_CTLLH;
            };
          };
          union {
            __IO uint16_t WDG_CTLH;
            struct {
              __IO uint8_t WDG_CTLHL;
              __IO uint8_t WDG_CTLHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WDG_ICL;
        struct {
          union {
            __IO uint16_t WDG_ICLL;
            struct {
              __IO uint8_t WDG_ICLLL;
              __IO uint8_t WDG_ICLLH;
            };
          };
          union {
            __IO uint16_t WDG_ICLH;
            struct {
              __IO uint8_t WDG_ICLHL;
              __IO uint8_t WDG_ICLHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WDG_RIS;
        stc_hwwdt_wdg_ris_field_t WDG_RIS_f;
        struct {
          union {
            __IO uint16_t WDG_RISL;
            struct {
              __IO uint8_t WDG_RISLL;
              __IO uint8_t WDG_RISLH;
            };
          };
          union {
            __IO uint16_t WDG_RISH;
            struct {
              __IO uint8_t WDG_RISHL;
              __IO uint8_t WDG_RISHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED0[3052];
    union {
        __IO uint32_t WDG_LCK;
        struct {
          union {
            __IO uint16_t WDG_LCKL;
            struct {
              __IO uint8_t WDG_LCKLL;
              __IO uint8_t WDG_LCKLH;
            };
          };
          union {
            __IO uint16_t WDG_LCKH;
            struct {
              __IO uint8_t WDG_LCKHL;
              __IO uint8_t WDG_LCKHH;
            };
          };
        };
    };
} FM_HWWDT_TypeDef, FM4_HWWDT_TypeDef;

