rusefi/rusefi/firmware/config/boards/cypress/OS/os/common/ext/CMSIS/S6E2CxAH/s6e2c5xh.h
/*******************************************************************************
* CAN Registers CAN1
*   Register Definition
*******************************************************************************/
#define FM_CAN1_CTRLR                             *((volatile uint16_t*)(0x40063000UL))
#define FM4_CAN1_CTRLR                            *((volatile uint16_t*)(0x40063000UL))
#define FM_CAN1_STATR                             *((volatile uint16_t*)(0x40063002UL))
#define FM4_CAN1_STATR                            *((volatile uint16_t*)(0x40063002UL))
#define FM_CAN1_ERRCNT                            *((volatile uint16_t*)(0x40063004UL))
#define FM4_CAN1_ERRCNT                           *((volatile uint16_t*)(0x40063004UL))
#define FM_CAN1_BTR                               *((volatile uint16_t*)(0x40063006UL))
#define FM4_CAN1_BTR                              *((volatile uint16_t*)(0x40063006UL))
#define FM_CAN1_INTR                              *((volatile uint16_t*)(0x40063008UL))
#define FM4_CAN1_INTR                             *((volatile uint16_t*)(0x40063008UL))
#define FM_CAN1_TESTR                             *((volatile uint16_t*)(0x4006300AUL))
#define FM4_CAN1_TESTR                            *((volatile uint16_t*)(0x4006300AUL))
#define FM_CAN1_BRPER                             *((volatile uint16_t*)(0x4006300CUL))
#define FM4_CAN1_BRPER                            *((volatile uint16_t*)(0x4006300CUL))
#define FM_CAN1_IF1CREQ                           *((volatile uint16_t*)(0x40063010UL))
#define FM4_CAN1_IF1CREQ                          *((volatile uint16_t*)(0x40063010UL))
#define FM_CAN1_IF1CMSK                           *((volatile uint16_t*)(0x40063012UL))
#define FM4_CAN1_IF1CMSK                          *((volatile uint16_t*)(0x40063012UL))
#define FM_CAN1_IF1MSK                            *((volatile uint32_t*)(0x40063014UL))
#define FM4_CAN1_IF1MSK                           *((volatile uint32_t*)(0x40063014UL))
#define FM_CAN1_IF1ARB                            *((volatile uint32_t*)(0x40063018UL))
#define FM4_CAN1_IF1ARB                           *((volatile uint32_t*)(0x40063018UL))
#define FM_CAN1_IF1MCTR                           *((volatile uint16_t*)(0x4006301CUL))
#define FM4_CAN1_IF1MCTR                          *((volatile uint16_t*)(0x4006301CUL))
#define FM_CAN1_IF1DTA_L                          *((volatile uint32_t*)(0x40063020UL))
#define FM4_CAN1_IF1DTA_L                         *((volatile uint32_t*)(0x40063020UL))
#define FM_CAN1_IF1DTB_L                          *((volatile uint32_t*)(0x40063024UL))
#define FM4_CAN1_IF1DTB_L                         *((volatile uint32_t*)(0x40063024UL))
#define FM_CAN1_IF1DTA_B                          *((volatile uint32_t*)(0x40063030UL))
#define FM4_CAN1_IF1DTA_B                         *((volatile uint32_t*)(0x40063030UL))
#define FM_CAN1_IF1DTB_B                          *((volatile uint32_t*)(0x40063034UL))
#define FM4_CAN1_IF1DTB_B                         *((volatile uint32_t*)(0x40063034UL))
#define FM_CAN1_IF2CREQ                           *((volatile uint16_t*)(0x40063040UL))
#define FM4_CAN1_IF2CREQ                          *((volatile uint16_t*)(0x40063040UL))
#define FM_CAN1_IF2CMSK                           *((volatile uint16_t*)(0x40063042UL))
#define FM4_CAN1_IF2CMSK                          *((volatile uint16_t*)(0x40063042UL))
#define FM_CAN1_IF2MSK                            *((volatile uint32_t*)(0x40063044UL))
#define FM4_CAN1_IF2MSK                           *((volatile uint32_t*)(0x40063044UL))
#define FM_CAN1_IF2ARB                            *((volatile uint32_t*)(0x40063048UL))
#define FM4_CAN1_IF2ARB                           *((volatile uint32_t*)(0x40063048UL))
#define FM_CAN1_IF2MCTR                           *((volatile uint16_t*)(0x4006304CUL))
#define FM4_CAN1_IF2MCTR                          *((volatile uint16_t*)(0x4006304CUL))
#define FM_CAN1_IF2DTA_L                          *((volatile uint32_t*)(0x40063050UL))
#define FM4_CAN1_IF2DTA_L                         *((volatile uint32_t*)(0x40063050UL))
#define FM_CAN1_IF2DTB_L                          *((volatile uint32_t*)(0x40063054UL))
#define FM4_CAN1_IF2DTB_L                         *((volatile uint32_t*)(0x40063054UL))
#define FM_CAN1_IF2DTA_B                          *((volatile uint32_t*)(0x40063060UL))
#define FM4_CAN1_IF2DTA_B                         *((volatile uint32_t*)(0x40063060UL))
#define FM_CAN1_IF2DTB_B                          *((volatile uint32_t*)(0x40063064UL))
#define FM4_CAN1_IF2DTB_B                         *((volatile uint32_t*)(0x40063064UL))
#define FM_CAN1_TREQR                             *((volatile uint32_t*)(0x40063080UL))
#define FM4_CAN1_TREQR                            *((volatile uint32_t*)(0x40063080UL))
#define FM_CAN1_NEWDT                             *((volatile uint32_t*)(0x40063090UL))
#define FM4_CAN1_NEWDT                            *((volatile uint32_t*)(0x40063090UL))
#define FM_CAN1_INTPND                            *((volatile uint32_t*)(0x400630A0UL))
#define FM4_CAN1_INTPND                           *((volatile uint32_t*)(0x400630A0UL))
#define FM_CAN1_MSGVAL                            *((volatile uint32_t*)(0x400630B0UL))
#define FM4_CAN1_MSGVAL                           *((volatile uint32_t*)(0x400630B0UL))

/*******************************************************************************
* CANFD Registers CANFD0
*   Register Definition
*******************************************************************************/
#define FM_CANFD0_CREL                            *((volatile uint32_t*)(0x40070000UL))
#define FM4_CANFD0_CREL                           *((volatile uint32_t*)(0x40070000UL))
#define FM_CANFD0_ENDN                            *((volatile uint32_t*)(0x40070004UL))
#define FM4_CANFD0_ENDN                           *((volatile uint32_t*)(0x40070004UL))
#define FM_CANFD0_FBTP                            *((volatile uint32_t*)(0x4007000CUL))
#define FM4_CANFD0_FBTP                           *((volatile uint32_t*)(0x4007000CUL))
#define FM_CANFD0_TEST                            *((volatile uint32_t*)(0x40070010UL))
#define FM4_CANFD0_TEST                           *((volatile uint32_t*)(0x40070010UL))
#define FM_CANFD0_RWD                             *((volatile uint32_t*)(0x40070014UL))
#define FM4_CANFD0_RWD                            *((volatile uint32_t*)(0x40070014UL))
#define FM_CANFD0_CCCR                            *((volatile uint32_t*)(0x40070018UL))
#define FM4_CANFD0_CCCR                           *((volatile uint32_t*)(0x40070018UL))
#define FM_CANFD0_BTP                             *((volatile uint32_t*)(0x4007001CUL))
#define FM4_CANFD0_BTP                            *((volatile uint32_t*)(0x4007001CUL))
#define FM_CANFD0_TSCC                            *((volatile uint32_t*)(0x40070020UL))
#define FM4_CANFD0_TSCC                           *((volatile uint32_t*)(0x40070020UL))
#define FM_CANFD0_TSCV                            *((volatile uint32_t*)(0x40070024UL))
#define FM4_CANFD0_TSCV                           *((volatile uint32_t*)(0x40070024UL))
#define FM_CANFD0_TOCC                            *((volatile uint32_t*)(0x40070028UL))
#define FM4_CANFD0_TOCC                           *((volatile uint32_t*)(0x40070028UL))
#define FM_CANFD0_TOCV                            *((volatile uint32_t*)(0x4007002CUL))
#define FM4_CANFD0_TOCV                           *((volatile uint32_t*)(0x4007002CUL))
#define FM_CANFD0_ECR                             *((volatile uint32_t*)(0x40070040UL))
#define FM4_CANFD0_ECR                            *((volatile uint32_t*)(0x40070040UL))
#define FM_CANFD0_PSR                             *((volatile uint32_t*)(0x40070044UL))
#define FM4_CANFD0_PSR                            *((volatile uint32_t*)(0x40070044UL))
#define FM_CANFD0_IR                              *((volatile uint32_t*)(0x40070050UL))
#define FM4_CANFD0_IR                             *((volatile uint32_t*)(0x40070050UL))
#define FM_CANFD0_IE                              *((volatile uint32_t*)(0x40070054UL))
#define FM4_CANFD0_IE                             *((volatile uint32_t*)(0x40070054UL))
#define FM_CANFD0_ILS                             *((volatile uint32_t*)(0x40070058UL))
#define FM4_CANFD0_ILS                            *((volatile uint32_t*)(0x40070058UL))
#define FM_CANFD0_ILE                             *((volatile uint32_t*)(0x4007005CUL))
#define FM4_CANFD0_ILE                            *((volatile uint32_t*)(0x4007005CUL))
#define FM_CANFD0_GFC                             *((volatile uint32_t*)(0x40070080UL))
#define FM4_CANFD0_GFC                            *((volatile uint32_t*)(0x40070080UL))
#define FM_CANFD0_SIDFC                           *((volatile uint32_t*)(0x40070084UL))
#define FM4_CANFD0_SIDFC                          *((volatile uint32_t*)(0x40070084UL))
#define FM_CANFD0_XIDFC                           *((volatile uint32_t*)(0x40070088UL))
#define FM4_CANFD0_XIDFC                          *((volatile uint32_t*)(0x40070088UL))
#define FM_CANFD0_XIDAM                           *((volatile uint32_t*)(0x40070090UL))
#define FM4_CANFD0_XIDAM                          *((volatile uint32_t*)(0x40070090UL))
#define FM_CANFD0_HPMS                            *((volatile uint32_t*)(0x40070094UL))
#define FM4_CANFD0_HPMS                           *((volatile uint32_t*)(0x40070094UL))
#define FM_CANFD0_NDAT1                           *((volatile uint32_t*)(0x40070098UL))
#define FM4_CANFD0_NDAT1                          *((volatile uint32_t*)(0x40070098UL))
#define FM_CANFD0_NDAT2                           *((volatile uint32_t*)(0x4007009CUL))
#define FM4_CANFD0_NDAT2                          *((volatile uint32_t*)(0x4007009CUL))
#define FM_CANFD0_RXF0C                           *((volatile uint32_t*)(0x400700A0UL))
#define FM4_CANFD0_RXF0C                          *((volatile uint32_t*)(0x400700A0UL))
#define FM_CANFD0_RXF0S                           *((volatile uint32_t*)(0x400700A4UL))
#define FM4_CANFD0_RXF0S                          *((volatile uint32_t*)(0x400700A4UL))
#define FM_CANFD0_RXF0A                           *((volatile uint32_t*)(0x400700A8UL))
#define FM4_CANFD0_RXF0A                          *((volatile uint32_t*)(0x400700A8UL))
#define FM_CANFD0_RXBC                            *((volatile uint32_t*)(0x400700ACUL))
#define FM4_CANFD0_RXBC                           *((volatile uint32_t*)(0x400700ACUL))
#define FM_CANFD0_RXF1C                           *((volatile uint32_t*)(0x400700B0UL))
#define FM4_CANFD0_RXF1C                          *((volatile uint32_t*)(0x400700B0UL))
#define FM_CANFD0_RXF1S                           *((volatile uint32_t*)(0x400700B4UL))
#define FM4_CANFD0_RXF1S                          *((volatile uint32_t*)(0x400700B4UL))
#define FM_CANFD0_RXF1A                           *((volatile uint32_t*)(0x400700B8UL))
#define FM4_CANFD0_RXF1A                          *((volatile uint32_t*)(0x400700B8UL))
#define FM_CANFD0_RXESC                           *((volatile uint32_t*)(0x400700BCUL))
#define FM4_CANFD0_RXESC                          *((volatile uint32_t*)(0x400700BCUL))
#define FM_CANFD0_TXBC                            *((volatile uint32_t*)(0x400700C0UL))
#define FM4_CANFD0_TXBC                           *((volatile uint32_t*)(0x400700C0UL))
#define FM_CANFD0_TXFQS                           *((volatile uint32_t*)(0x400700C4UL))
#define FM4_CANFD0_TXFQS                          *((volatile uint32_t*)(0x400700C4UL))
#define FM_CANFD0_TXESC                           *((volatile uint32_t*)(0x400700C8UL))
#define FM4_CANFD0_TXESC                          *((volatile uint32_t*)(0x400700C8UL))
#define FM_CANFD0_TXBRP                           *((volatile uint32_t*)(0x400700CCUL))
#define FM4_CANFD0_TXBRP                          *((volatile uint32_t*)(0x400700CCUL))
#define FM_CANFD0_TXBAR                           *((volatile uint32_t*)(0x400700D0UL))
#define FM4_CANFD0_TXBAR                          *((volatile uint32_t*)(0x400700D0UL))
#define FM_CANFD0_TXBCR                           *((volatile uint32_t*)(0x400700D4UL))
#define FM4_CANFD0_TXBCR                          *((volatile uint32_t*)(0x400700D4UL))
#define FM_CANFD0_TXBTO                           *((volatile uint32_t*)(0x400700D8UL))
#define FM4_CANFD0_TXBTO                          *((volatile uint32_t*)(0x400700D8UL))
#define FM_CANFD0_TXBCF                           *((volatile uint32_t*)(0x400700DCUL))
#define FM4_CANFD0_TXBCF                          *((volatile uint32_t*)(0x400700DCUL))
#define FM_CANFD0_TXBTIE                          *((volatile uint32_t*)(0x400700E0UL))
#define FM4_CANFD0_TXBTIE                         *((volatile uint32_t*)(0x400700E0UL))
#define FM_CANFD0_TXBCIE                          *((volatile uint32_t*)(0x400700E4UL))
#define FM4_CANFD0_TXBCIE                         *((volatile uint32_t*)(0x400700E4UL))
#define FM_CANFD0_TXEFC                           *((volatile uint32_t*)(0x400700F0UL))
#define FM4_CANFD0_TXEFC                          *((volatile uint32_t*)(0x400700F0UL))
#define FM_CANFD0_TXFS                            *((volatile uint32_t*)(0x400700F4UL))
#define FM4_CANFD0_TXFS                           *((volatile uint32_t*)(0x400700F4UL))
#define FM_CANFD0_TXFA                            *((volatile uint32_t*)(0x400700F8UL))
#define FM4_CANFD0_TXFA                           *((volatile uint32_t*)(0x400700F8UL))
#define FM_CANFD0_FDECR                           *((volatile  uint8_t*)(0x40070200UL))
#define FM4_CANFD0_FDECR                          *((volatile  uint8_t*)(0x40070200UL))
#define FM_CANFD0_FDESR                           *((volatile  uint8_t*)(0x40070201UL))
#define FM4_CANFD0_FDESR                          *((volatile  uint8_t*)(0x40070201UL))
#define FM_CANFD0_FDSEAR                          *((volatile uint16_t*)(0x40070202UL))
#define FM4_CANFD0_FDSEAR                         *((volatile uint16_t*)(0x40070202UL))
#define FM_CANFD0_FDESCR                          *((volatile  uint8_t*)(0x40070205UL))
#define FM4_CANFD0_FDESCR                         *((volatile  uint8_t*)(0x40070205UL))
#define FM_CANFD0_FDDEAR                          *((volatile uint16_t*)(0x40070206UL))
#define FM4_CANFD0_FDDEAR                         *((volatile uint16_t*)(0x40070206UL))
#define FM_CANFD0_TSCNTR                          *((volatile uint16_t*)(0x40070210UL))
#define FM4_CANFD0_TSCNTR                         *((volatile uint16_t*)(0x40070210UL))
#define FM_CANFD0_TSMDR                           *((volatile uint16_t*)(0x40070212UL))
#define FM4_CANFD0_TSMDR                          *((volatile uint16_t*)(0x40070212UL))
#define FM_CANFD0_TSDIVR                          *((volatile uint32_t*)(0x40070214UL))
#define FM4_CANFD0_TSDIVR                         *((volatile uint32_t*)(0x40070214UL))
#define FM_CANFD0_TSCDTR                          *((volatile uint16_t*)(0x40070218UL))
#define FM4_CANFD0_TSCDTR                         *((volatile uint16_t*)(0x40070218UL))
#define FM_CANFD0_TSCPCLR                         *((volatile uint16_t*)(0x4007021AUL))
#define FM4_CANFD0_TSCPCLR                        *((volatile uint16_t*)(0x4007021AUL))

