rusefi/rusefi/firmware/config/boards/cypress/OS/os/common/ext/CMSIS/S6E2CxAH/s6e2c5xh.h
#define bFM_GPIO_PCR1_P0                          *((volatile  uint8_t *)(0x42DE2080UL))
#define bFM4_GPIO_PCR1_P0                         *((volatile  uint8_t *)(0x42DE2080UL))
#define bFM_GPIO_PCR1_P1                          *((volatile  uint8_t *)(0x42DE2084UL))
#define bFM4_GPIO_PCR1_P1                         *((volatile  uint8_t *)(0x42DE2084UL))
#define bFM_GPIO_PCR1_P2                          *((volatile  uint8_t *)(0x42DE2088UL))
#define bFM4_GPIO_PCR1_P2                         *((volatile  uint8_t *)(0x42DE2088UL))
#define bFM_GPIO_PCR1_P3                          *((volatile  uint8_t *)(0x42DE208CUL))
#define bFM4_GPIO_PCR1_P3                         *((volatile  uint8_t *)(0x42DE208CUL))
#define bFM_GPIO_PCR1_P4                          *((volatile  uint8_t *)(0x42DE2090UL))
#define bFM4_GPIO_PCR1_P4                         *((volatile  uint8_t *)(0x42DE2090UL))
#define bFM_GPIO_PCR1_P5                          *((volatile  uint8_t *)(0x42DE2094UL))
#define bFM4_GPIO_PCR1_P5                         *((volatile  uint8_t *)(0x42DE2094UL))
#define bFM_GPIO_PCR1_P6                          *((volatile  uint8_t *)(0x42DE2098UL))
#define bFM4_GPIO_PCR1_P6                         *((volatile  uint8_t *)(0x42DE2098UL))
#define bFM_GPIO_PCR1_P7                          *((volatile  uint8_t *)(0x42DE209CUL))
#define bFM4_GPIO_PCR1_P7                         *((volatile  uint8_t *)(0x42DE209CUL))
#define bFM_GPIO_PCR1_P8                          *((volatile  uint8_t *)(0x42DE20A0UL))
#define bFM4_GPIO_PCR1_P8                         *((volatile  uint8_t *)(0x42DE20A0UL))
#define bFM_GPIO_PCR1_P9                          *((volatile  uint8_t *)(0x42DE20A4UL))
#define bFM4_GPIO_PCR1_P9                         *((volatile  uint8_t *)(0x42DE20A4UL))
#define bFM_GPIO_PCR1_PA                          *((volatile  uint8_t *)(0x42DE20A8UL))
#define bFM4_GPIO_PCR1_PA                         *((volatile  uint8_t *)(0x42DE20A8UL))
#define bFM_GPIO_PCR1_PB                          *((volatile  uint8_t *)(0x42DE20ACUL))
#define bFM4_GPIO_PCR1_PB                         *((volatile  uint8_t *)(0x42DE20ACUL))
#define bFM_GPIO_PCR1_PC                          *((volatile  uint8_t *)(0x42DE20B0UL))
#define bFM4_GPIO_PCR1_PC                         *((volatile  uint8_t *)(0x42DE20B0UL))
#define bFM_GPIO_PCR1_PD                          *((volatile  uint8_t *)(0x42DE20B4UL))
#define bFM4_GPIO_PCR1_PD                         *((volatile  uint8_t *)(0x42DE20B4UL))
#define bFM_GPIO_PCR1_PE                          *((volatile  uint8_t *)(0x42DE20B8UL))
#define bFM4_GPIO_PCR1_PE                         *((volatile  uint8_t *)(0x42DE20B8UL))
#define bFM_GPIO_PCR1_PF                          *((volatile  uint8_t *)(0x42DE20BCUL))
#define bFM4_GPIO_PCR1_PF                         *((volatile  uint8_t *)(0x42DE20BCUL))

#define bFM_GPIO_PCR2_P0                          *((volatile  uint8_t *)(0x42DE2100UL))
#define bFM4_GPIO_PCR2_P0                         *((volatile  uint8_t *)(0x42DE2100UL))
#define bFM_GPIO_PCR2_P1                          *((volatile  uint8_t *)(0x42DE2104UL))
#define bFM4_GPIO_PCR2_P1                         *((volatile  uint8_t *)(0x42DE2104UL))
#define bFM_GPIO_PCR2_P2                          *((volatile  uint8_t *)(0x42DE2108UL))
#define bFM4_GPIO_PCR2_P2                         *((volatile  uint8_t *)(0x42DE2108UL))
#define bFM_GPIO_PCR2_P3                          *((volatile  uint8_t *)(0x42DE210CUL))
#define bFM4_GPIO_PCR2_P3                         *((volatile  uint8_t *)(0x42DE210CUL))
#define bFM_GPIO_PCR2_P4                          *((volatile  uint8_t *)(0x42DE2110UL))
#define bFM4_GPIO_PCR2_P4                         *((volatile  uint8_t *)(0x42DE2110UL))
#define bFM_GPIO_PCR2_P5                          *((volatile  uint8_t *)(0x42DE2114UL))
#define bFM4_GPIO_PCR2_P5                         *((volatile  uint8_t *)(0x42DE2114UL))
#define bFM_GPIO_PCR2_P6                          *((volatile  uint8_t *)(0x42DE2118UL))
#define bFM4_GPIO_PCR2_P6                         *((volatile  uint8_t *)(0x42DE2118UL))
#define bFM_GPIO_PCR2_P7                          *((volatile  uint8_t *)(0x42DE211CUL))
#define bFM4_GPIO_PCR2_P7                         *((volatile  uint8_t *)(0x42DE211CUL))
#define bFM_GPIO_PCR2_P8                          *((volatile  uint8_t *)(0x42DE2120UL))
#define bFM4_GPIO_PCR2_P8                         *((volatile  uint8_t *)(0x42DE2120UL))
#define bFM_GPIO_PCR2_P9                          *((volatile  uint8_t *)(0x42DE2124UL))
#define bFM4_GPIO_PCR2_P9                         *((volatile  uint8_t *)(0x42DE2124UL))
#define bFM_GPIO_PCR2_PA                          *((volatile  uint8_t *)(0x42DE2128UL))
#define bFM4_GPIO_PCR2_PA                         *((volatile  uint8_t *)(0x42DE2128UL))

#define bFM_GPIO_PCR3_P2                          *((volatile  uint8_t *)(0x42DE2188UL))
#define bFM4_GPIO_PCR3_P2                         *((volatile  uint8_t *)(0x42DE2188UL))
#define bFM_GPIO_PCR3_P3                          *((volatile  uint8_t *)(0x42DE218CUL))
#define bFM4_GPIO_PCR3_P3                         *((volatile  uint8_t *)(0x42DE218CUL))
#define bFM_GPIO_PCR3_P4                          *((volatile  uint8_t *)(0x42DE2190UL))
#define bFM4_GPIO_PCR3_P4                         *((volatile  uint8_t *)(0x42DE2190UL))
#define bFM_GPIO_PCR3_P5                          *((volatile  uint8_t *)(0x42DE2194UL))
#define bFM4_GPIO_PCR3_P5                         *((volatile  uint8_t *)(0x42DE2194UL))
#define bFM_GPIO_PCR3_P6                          *((volatile  uint8_t *)(0x42DE2198UL))
#define bFM4_GPIO_PCR3_P6                         *((volatile  uint8_t *)(0x42DE2198UL))
#define bFM_GPIO_PCR3_P7                          *((volatile  uint8_t *)(0x42DE219CUL))
#define bFM4_GPIO_PCR3_P7                         *((volatile  uint8_t *)(0x42DE219CUL))
#define bFM_GPIO_PCR3_P8                          *((volatile  uint8_t *)(0x42DE21A0UL))
#define bFM4_GPIO_PCR3_P8                         *((volatile  uint8_t *)(0x42DE21A0UL))
#define bFM_GPIO_PCR3_P9                          *((volatile  uint8_t *)(0x42DE21A4UL))
#define bFM4_GPIO_PCR3_P9                         *((volatile  uint8_t *)(0x42DE21A4UL))
#define bFM_GPIO_PCR3_PA                          *((volatile  uint8_t *)(0x42DE21A8UL))
#define bFM4_GPIO_PCR3_PA                         *((volatile  uint8_t *)(0x42DE21A8UL))
#define bFM_GPIO_PCR3_PB                          *((volatile  uint8_t *)(0x42DE21ACUL))
#define bFM4_GPIO_PCR3_PB                         *((volatile  uint8_t *)(0x42DE21ACUL))
#define bFM_GPIO_PCR3_PC                          *((volatile  uint8_t *)(0x42DE21B0UL))
#define bFM4_GPIO_PCR3_PC                         *((volatile  uint8_t *)(0x42DE21B0UL))
#define bFM_GPIO_PCR3_PD                          *((volatile  uint8_t *)(0x42DE21B4UL))
#define bFM4_GPIO_PCR3_PD                         *((volatile  uint8_t *)(0x42DE21B4UL))
#define bFM_GPIO_PCR3_PE                          *((volatile  uint8_t *)(0x42DE21B8UL))
#define bFM4_GPIO_PCR3_PE                         *((volatile  uint8_t *)(0x42DE21B8UL))

#define bFM_GPIO_PCR4_P0                          *((volatile  uint8_t *)(0x42DE2200UL))
#define bFM4_GPIO_PCR4_P0                         *((volatile  uint8_t *)(0x42DE2200UL))
#define bFM_GPIO_PCR4_P1                          *((volatile  uint8_t *)(0x42DE2204UL))
#define bFM4_GPIO_PCR4_P1                         *((volatile  uint8_t *)(0x42DE2204UL))
#define bFM_GPIO_PCR4_P2                          *((volatile  uint8_t *)(0x42DE2208UL))
#define bFM4_GPIO_PCR4_P2                         *((volatile  uint8_t *)(0x42DE2208UL))
#define bFM_GPIO_PCR4_P3                          *((volatile  uint8_t *)(0x42DE220CUL))
#define bFM4_GPIO_PCR4_P3                         *((volatile  uint8_t *)(0x42DE220CUL))
#define bFM_GPIO_PCR4_P4                          *((volatile  uint8_t *)(0x42DE2210UL))
#define bFM4_GPIO_PCR4_P4                         *((volatile  uint8_t *)(0x42DE2210UL))
#define bFM_GPIO_PCR4_P5                          *((volatile  uint8_t *)(0x42DE2214UL))
#define bFM4_GPIO_PCR4_P5                         *((volatile  uint8_t *)(0x42DE2214UL))
#define bFM_GPIO_PCR4_P6                          *((volatile  uint8_t *)(0x42DE2218UL))
#define bFM4_GPIO_PCR4_P6                         *((volatile  uint8_t *)(0x42DE2218UL))
#define bFM_GPIO_PCR4_P7                          *((volatile  uint8_t *)(0x42DE221CUL))
#define bFM4_GPIO_PCR4_P7                         *((volatile  uint8_t *)(0x42DE221CUL))
#define bFM_GPIO_PCR4_P8                          *((volatile  uint8_t *)(0x42DE2220UL))
#define bFM4_GPIO_PCR4_P8                         *((volatile  uint8_t *)(0x42DE2220UL))
#define bFM_GPIO_PCR4_P9                          *((volatile  uint8_t *)(0x42DE2224UL))
#define bFM4_GPIO_PCR4_P9                         *((volatile  uint8_t *)(0x42DE2224UL))

#define bFM_GPIO_PCR6_P0                          *((volatile  uint8_t *)(0x42DE2300UL))
#define bFM4_GPIO_PCR6_P0                         *((volatile  uint8_t *)(0x42DE2300UL))
#define bFM_GPIO_PCR6_P1                          *((volatile  uint8_t *)(0x42DE2304UL))
#define bFM4_GPIO_PCR6_P1                         *((volatile  uint8_t *)(0x42DE2304UL))
#define bFM_GPIO_PCR6_P2                          *((volatile  uint8_t *)(0x42DE2308UL))
#define bFM4_GPIO_PCR6_P2                         *((volatile  uint8_t *)(0x42DE2308UL))
#define bFM_GPIO_PCR6_P3                          *((volatile  uint8_t *)(0x42DE230CUL))
#define bFM4_GPIO_PCR6_P3                         *((volatile  uint8_t *)(0x42DE230CUL))
#define bFM_GPIO_PCR6_PE                          *((volatile  uint8_t *)(0x42DE2338UL))
#define bFM4_GPIO_PCR6_PE                         *((volatile  uint8_t *)(0x42DE2338UL))

