rusefi/rusefi/firmware/config/boards/cypress/OS/os/common/ext/CMSIS/S6E2CxAH/s6e2c5xh.h
/*******************************************************************************
* MFS Registers MFS10
*   Bitband Section
*******************************************************************************/
#define bFM_MFS10_CSIO_ESCR_CSFE                  *((volatile  uint8_t *)(0x42714094UL))
#define bFM4_MFS10_CSIO_ESCR_CSFE                 *((volatile  uint8_t *)(0x42714094UL))
#define bFM_MFS10_CSIO_ESCR_L3                    *((volatile  uint8_t *)(0x42714098UL))
#define bFM4_MFS10_CSIO_ESCR_L3                   *((volatile  uint8_t *)(0x42714098UL))
#define bFM_MFS10_CSIO_ESCR_SOP                   *((volatile  uint8_t *)(0x4271409CUL))
#define bFM4_MFS10_CSIO_ESCR_SOP                  *((volatile  uint8_t *)(0x4271409CUL))

#define bFM_MFS10_CSIO_FCR_FE1                    *((volatile  uint8_t *)(0x42714280UL))
#define bFM4_MFS10_CSIO_FCR_FE1                   *((volatile  uint8_t *)(0x42714280UL))
#define bFM_MFS10_CSIO_FCR_FE2                    *((volatile  uint8_t *)(0x42714284UL))
#define bFM4_MFS10_CSIO_FCR_FE2                   *((volatile  uint8_t *)(0x42714284UL))
#define bFM_MFS10_CSIO_FCR_FCL1                   *((volatile  uint8_t *)(0x42714288UL))
#define bFM4_MFS10_CSIO_FCR_FCL1                  *((volatile  uint8_t *)(0x42714288UL))
#define bFM_MFS10_CSIO_FCR_FCL2                   *((volatile  uint8_t *)(0x4271428CUL))
#define bFM4_MFS10_CSIO_FCR_FCL2                  *((volatile  uint8_t *)(0x4271428CUL))
#define bFM_MFS10_CSIO_FCR_FSET                   *((volatile  uint8_t *)(0x42714290UL))
#define bFM4_MFS10_CSIO_FCR_FSET                  *((volatile  uint8_t *)(0x42714290UL))
#define bFM_MFS10_CSIO_FCR_FLD                    *((volatile  uint8_t *)(0x42714294UL))
#define bFM4_MFS10_CSIO_FCR_FLD                   *((volatile  uint8_t *)(0x42714294UL))
#define bFM_MFS10_CSIO_FCR_FLST                   *((volatile  uint8_t *)(0x42714298UL))
#define bFM4_MFS10_CSIO_FCR_FLST                  *((volatile  uint8_t *)(0x42714298UL))
#define bFM_MFS10_CSIO_FCR_FSEL                   *((volatile  uint8_t *)(0x427142A0UL))
#define bFM4_MFS10_CSIO_FCR_FSEL                  *((volatile  uint8_t *)(0x427142A0UL))
#define bFM_MFS10_CSIO_FCR_FTIE                   *((volatile  uint8_t *)(0x427142A4UL))
#define bFM4_MFS10_CSIO_FCR_FTIE                  *((volatile  uint8_t *)(0x427142A4UL))
#define bFM_MFS10_CSIO_FCR_FDRQ                   *((volatile  uint8_t *)(0x427142A8UL))
#define bFM4_MFS10_CSIO_FCR_FDRQ                  *((volatile  uint8_t *)(0x427142A8UL))
#define bFM_MFS10_CSIO_FCR_FRIIE                  *((volatile  uint8_t *)(0x427142ACUL))
#define bFM4_MFS10_CSIO_FCR_FRIIE                 *((volatile  uint8_t *)(0x427142ACUL))
#define bFM_MFS10_CSIO_FCR_FLSTE                  *((volatile  uint8_t *)(0x427142B0UL))
#define bFM4_MFS10_CSIO_FCR_FLSTE                 *((volatile  uint8_t *)(0x427142B0UL))

#define bFM_MFS10_CSIO_SACSR_TMRE                 *((volatile  uint8_t *)(0x42714480UL))
#define bFM4_MFS10_CSIO_SACSR_TMRE                *((volatile  uint8_t *)(0x42714480UL))
#define bFM_MFS10_CSIO_SACSR_TSYNE                *((volatile  uint8_t *)(0x42714498UL))
#define bFM4_MFS10_CSIO_SACSR_TSYNE               *((volatile  uint8_t *)(0x42714498UL))
#define bFM_MFS10_CSIO_SACSR_TINTE                *((volatile  uint8_t *)(0x4271449CUL))
#define bFM4_MFS10_CSIO_SACSR_TINTE               *((volatile  uint8_t *)(0x4271449CUL))
#define bFM_MFS10_CSIO_SACSR_TINT                 *((volatile  uint8_t *)(0x427144A0UL))
#define bFM4_MFS10_CSIO_SACSR_TINT                *((volatile  uint8_t *)(0x427144A0UL))
#define bFM_MFS10_CSIO_SACSR_CSE                  *((volatile  uint8_t *)(0x427144ACUL))
#define bFM4_MFS10_CSIO_SACSR_CSE                 *((volatile  uint8_t *)(0x427144ACUL))
#define bFM_MFS10_CSIO_SACSR_CSEIE                *((volatile  uint8_t *)(0x427144B0UL))
#define bFM4_MFS10_CSIO_SACSR_CSEIE               *((volatile  uint8_t *)(0x427144B0UL))
#define bFM_MFS10_CSIO_SACSR_TBEEN                *((volatile  uint8_t *)(0x427144B4UL))
#define bFM4_MFS10_CSIO_SACSR_TBEEN               *((volatile  uint8_t *)(0x427144B4UL))

#define bFM_MFS10_CSIO_SCR_TXE                    *((volatile  uint8_t *)(0x42714020UL))
#define bFM4_MFS10_CSIO_SCR_TXE                   *((volatile  uint8_t *)(0x42714020UL))
#define bFM_MFS10_CSIO_SCR_RXE                    *((volatile  uint8_t *)(0x42714024UL))
#define bFM4_MFS10_CSIO_SCR_RXE                   *((volatile  uint8_t *)(0x42714024UL))
#define bFM_MFS10_CSIO_SCR_TBIE                   *((volatile  uint8_t *)(0x42714028UL))
#define bFM4_MFS10_CSIO_SCR_TBIE                  *((volatile  uint8_t *)(0x42714028UL))
#define bFM_MFS10_CSIO_SCR_TIE                    *((volatile  uint8_t *)(0x4271402CUL))
#define bFM4_MFS10_CSIO_SCR_TIE                   *((volatile  uint8_t *)(0x4271402CUL))
#define bFM_MFS10_CSIO_SCR_RIE                    *((volatile  uint8_t *)(0x42714030UL))
#define bFM4_MFS10_CSIO_SCR_RIE                   *((volatile  uint8_t *)(0x42714030UL))
#define bFM_MFS10_CSIO_SCR_SPI                    *((volatile  uint8_t *)(0x42714034UL))
#define bFM4_MFS10_CSIO_SCR_SPI                   *((volatile  uint8_t *)(0x42714034UL))
#define bFM_MFS10_CSIO_SCR_MS                     *((volatile  uint8_t *)(0x42714038UL))
#define bFM4_MFS10_CSIO_SCR_MS                    *((volatile  uint8_t *)(0x42714038UL))
#define bFM_MFS10_CSIO_SCR_UPCL                   *((volatile  uint8_t *)(0x4271403CUL))
#define bFM4_MFS10_CSIO_SCR_UPCL                  *((volatile  uint8_t *)(0x4271403CUL))

#define bFM_MFS10_CSIO_SCSCR_CSOE                 *((volatile  uint8_t *)(0x42714600UL))
#define bFM4_MFS10_CSIO_SCSCR_CSOE                *((volatile  uint8_t *)(0x42714600UL))
#define bFM_MFS10_CSIO_SCSCR_CSEN0                *((volatile  uint8_t *)(0x42714604UL))
#define bFM4_MFS10_CSIO_SCSCR_CSEN0               *((volatile  uint8_t *)(0x42714604UL))
#define bFM_MFS10_CSIO_SCSCR_CSEN1                *((volatile  uint8_t *)(0x42714608UL))
#define bFM4_MFS10_CSIO_SCSCR_CSEN1               *((volatile  uint8_t *)(0x42714608UL))
#define bFM_MFS10_CSIO_SCSCR_CSEN2                *((volatile  uint8_t *)(0x4271460CUL))
#define bFM4_MFS10_CSIO_SCSCR_CSEN2               *((volatile  uint8_t *)(0x4271460CUL))
#define bFM_MFS10_CSIO_SCSCR_CSEN3                *((volatile  uint8_t *)(0x42714610UL))
#define bFM4_MFS10_CSIO_SCSCR_CSEN3               *((volatile  uint8_t *)(0x42714610UL))
#define bFM_MFS10_CSIO_SCSCR_CSLVL                *((volatile  uint8_t *)(0x42714614UL))
#define bFM4_MFS10_CSIO_SCSCR_CSLVL               *((volatile  uint8_t *)(0x42714614UL))
#define bFM_MFS10_CSIO_SCSCR_SCAM                 *((volatile  uint8_t *)(0x42714624UL))
#define bFM4_MFS10_CSIO_SCSCR_SCAM                *((volatile  uint8_t *)(0x42714624UL))

#define bFM_MFS10_CSIO_SCSFR0_CS1SPI              *((volatile  uint8_t *)(0x42714694UL))
#define bFM4_MFS10_CSIO_SCSFR0_CS1SPI             *((volatile  uint8_t *)(0x42714694UL))
#define bFM_MFS10_CSIO_SCSFR0_CS1SCINV            *((volatile  uint8_t *)(0x42714698UL))
#define bFM4_MFS10_CSIO_SCSFR0_CS1SCINV           *((volatile  uint8_t *)(0x42714698UL))
#define bFM_MFS10_CSIO_SCSFR0_CS1CSLVL            *((volatile  uint8_t *)(0x4271469CUL))
#define bFM4_MFS10_CSIO_SCSFR0_CS1CSLVL           *((volatile  uint8_t *)(0x4271469CUL))

#define bFM_MFS10_CSIO_SCSFR1_CS2SPI              *((volatile  uint8_t *)(0x427146B4UL))
#define bFM4_MFS10_CSIO_SCSFR1_CS2SPI             *((volatile  uint8_t *)(0x427146B4UL))
#define bFM_MFS10_CSIO_SCSFR1_CS2SCINV            *((volatile  uint8_t *)(0x427146B8UL))
#define bFM4_MFS10_CSIO_SCSFR1_CS2SCINV           *((volatile  uint8_t *)(0x427146B8UL))
#define bFM_MFS10_CSIO_SCSFR1_CS2CSLVL            *((volatile  uint8_t *)(0x427146BCUL))
#define bFM4_MFS10_CSIO_SCSFR1_CS2CSLVL           *((volatile  uint8_t *)(0x427146BCUL))

#define bFM_MFS10_CSIO_SCSFR2_CS3SPI              *((volatile  uint8_t *)(0x42714714UL))
#define bFM4_MFS10_CSIO_SCSFR2_CS3SPI             *((volatile  uint8_t *)(0x42714714UL))
#define bFM_MFS10_CSIO_SCSFR2_CS3SCINV            *((volatile  uint8_t *)(0x42714718UL))
#define bFM4_MFS10_CSIO_SCSFR2_CS3SCINV           *((volatile  uint8_t *)(0x42714718UL))
#define bFM_MFS10_CSIO_SCSFR2_CS3CSLVL            *((volatile  uint8_t *)(0x4271471CUL))
#define bFM4_MFS10_CSIO_SCSFR2_CS3CSLVL           *((volatile  uint8_t *)(0x4271471CUL))

#define bFM_MFS10_CSIO_SMR_SOE                    *((volatile  uint8_t *)(0x42714000UL))
#define bFM4_MFS10_CSIO_SMR_SOE                   *((volatile  uint8_t *)(0x42714000UL))
#define bFM_MFS10_CSIO_SMR_SCKE                   *((volatile  uint8_t *)(0x42714004UL))
#define bFM4_MFS10_CSIO_SMR_SCKE                  *((volatile  uint8_t *)(0x42714004UL))
#define bFM_MFS10_CSIO_SMR_BDS                    *((volatile  uint8_t *)(0x42714008UL))
#define bFM4_MFS10_CSIO_SMR_BDS                   *((volatile  uint8_t *)(0x42714008UL))
#define bFM_MFS10_CSIO_SMR_SCINV                  *((volatile  uint8_t *)(0x4271400CUL))
#define bFM4_MFS10_CSIO_SMR_SCINV                 *((volatile  uint8_t *)(0x4271400CUL))

#define bFM_MFS10_CSIO_SSR_TBI                    *((volatile  uint8_t *)(0x427140A0UL))
#define bFM4_MFS10_CSIO_SSR_TBI                   *((volatile  uint8_t *)(0x427140A0UL))
#define bFM_MFS10_CSIO_SSR_TDRE                   *((volatile  uint8_t *)(0x427140A4UL))
#define bFM4_MFS10_CSIO_SSR_TDRE                  *((volatile  uint8_t *)(0x427140A4UL))
#define bFM_MFS10_CSIO_SSR_RDRF                   *((volatile  uint8_t *)(0x427140A8UL))
#define bFM4_MFS10_CSIO_SSR_RDRF                  *((volatile  uint8_t *)(0x427140A8UL))
#define bFM_MFS10_CSIO_SSR_ORE                    *((volatile  uint8_t *)(0x427140ACUL))
#define bFM4_MFS10_CSIO_SSR_ORE                   *((volatile  uint8_t *)(0x427140ACUL))
#define bFM_MFS10_CSIO_SSR_AWC                    *((volatile  uint8_t *)(0x427140B0UL))
#define bFM4_MFS10_CSIO_SSR_AWC                   *((volatile  uint8_t *)(0x427140B0UL))
#define bFM_MFS10_CSIO_SSR_REC                    *((volatile  uint8_t *)(0x427140BCUL))
#define bFM4_MFS10_CSIO_SSR_REC                   *((volatile  uint8_t *)(0x427140BCUL))

#define bFM_MFS10_I2C_EIBCR_BEC                   *((volatile  uint8_t *)(0x427143A0UL))
#define bFM4_MFS10_I2C_EIBCR_BEC                  *((volatile  uint8_t *)(0x427143A0UL))
#define bFM_MFS10_I2C_EIBCR_SOCE                  *((volatile  uint8_t *)(0x427143A4UL))
#define bFM4_MFS10_I2C_EIBCR_SOCE                 *((volatile  uint8_t *)(0x427143A4UL))
#define bFM_MFS10_I2C_EIBCR_SCLC                  *((volatile  uint8_t *)(0x427143A8UL))
#define bFM4_MFS10_I2C_EIBCR_SCLC                 *((volatile  uint8_t *)(0x427143A8UL))
#define bFM_MFS10_I2C_EIBCR_SDAC                  *((volatile  uint8_t *)(0x427143ACUL))
#define bFM4_MFS10_I2C_EIBCR_SDAC                 *((volatile  uint8_t *)(0x427143ACUL))
#define bFM_MFS10_I2C_EIBCR_SCLS                  *((volatile  uint8_t *)(0x427143B0UL))
#define bFM4_MFS10_I2C_EIBCR_SCLS                 *((volatile  uint8_t *)(0x427143B0UL))
#define bFM_MFS10_I2C_EIBCR_SDAS                  *((volatile  uint8_t *)(0x427143B4UL))
#define bFM4_MFS10_I2C_EIBCR_SDAS                 *((volatile  uint8_t *)(0x427143B4UL))

#define bFM_MFS10_I2C_FCR_FE1                     *((volatile  uint8_t *)(0x42714280UL))
#define bFM4_MFS10_I2C_FCR_FE1                    *((volatile  uint8_t *)(0x42714280UL))
#define bFM_MFS10_I2C_FCR_FE2                     *((volatile  uint8_t *)(0x42714284UL))
#define bFM4_MFS10_I2C_FCR_FE2                    *((volatile  uint8_t *)(0x42714284UL))
#define bFM_MFS10_I2C_FCR_FCL1                    *((volatile  uint8_t *)(0x42714288UL))
#define bFM4_MFS10_I2C_FCR_FCL1                   *((volatile  uint8_t *)(0x42714288UL))
#define bFM_MFS10_I2C_FCR_FCL2                    *((volatile  uint8_t *)(0x4271428CUL))
#define bFM4_MFS10_I2C_FCR_FCL2                   *((volatile  uint8_t *)(0x4271428CUL))
#define bFM_MFS10_I2C_FCR_FSET                    *((volatile  uint8_t *)(0x42714290UL))
#define bFM4_MFS10_I2C_FCR_FSET                   *((volatile  uint8_t *)(0x42714290UL))
#define bFM_MFS10_I2C_FCR_FLD                     *((volatile  uint8_t *)(0x42714294UL))
#define bFM4_MFS10_I2C_FCR_FLD                    *((volatile  uint8_t *)(0x42714294UL))
#define bFM_MFS10_I2C_FCR_FLST                    *((volatile  uint8_t *)(0x42714298UL))
#define bFM4_MFS10_I2C_FCR_FLST                   *((volatile  uint8_t *)(0x42714298UL))
#define bFM_MFS10_I2C_FCR_FSEL                    *((volatile  uint8_t *)(0x427142A0UL))
#define bFM4_MFS10_I2C_FCR_FSEL                   *((volatile  uint8_t *)(0x427142A0UL))
#define bFM_MFS10_I2C_FCR_FTIE                    *((volatile  uint8_t *)(0x427142A4UL))
#define bFM4_MFS10_I2C_FCR_FTIE                   *((volatile  uint8_t *)(0x427142A4UL))
#define bFM_MFS10_I2C_FCR_FDRQ                    *((volatile  uint8_t *)(0x427142A8UL))
#define bFM4_MFS10_I2C_FCR_FDRQ                   *((volatile  uint8_t *)(0x427142A8UL))
#define bFM_MFS10_I2C_FCR_FRIIE                   *((volatile  uint8_t *)(0x427142ACUL))
#define bFM4_MFS10_I2C_FCR_FRIIE                  *((volatile  uint8_t *)(0x427142ACUL))
#define bFM_MFS10_I2C_FCR_FLSTE                   *((volatile  uint8_t *)(0x427142B0UL))
#define bFM4_MFS10_I2C_FCR_FLSTE                  *((volatile  uint8_t *)(0x427142B0UL))

