rusefi/rusefi/firmware/config/boards/cypress/OS/os/common/ext/CMSIS/S6E2CxAH/s6e2c5xh.h
#define bFM_MFS10_LIN_SCR_TXE                     *((volatile  uint8_t *)(0x42714020UL))
#define bFM4_MFS10_LIN_SCR_TXE                    *((volatile  uint8_t *)(0x42714020UL))
#define bFM_MFS10_LIN_SCR_RXE                     *((volatile  uint8_t *)(0x42714024UL))
#define bFM4_MFS10_LIN_SCR_RXE                    *((volatile  uint8_t *)(0x42714024UL))
#define bFM_MFS10_LIN_SCR_TBIE                    *((volatile  uint8_t *)(0x42714028UL))
#define bFM4_MFS10_LIN_SCR_TBIE                   *((volatile  uint8_t *)(0x42714028UL))
#define bFM_MFS10_LIN_SCR_TIE                     *((volatile  uint8_t *)(0x4271402CUL))
#define bFM4_MFS10_LIN_SCR_TIE                    *((volatile  uint8_t *)(0x4271402CUL))
#define bFM_MFS10_LIN_SCR_RIE                     *((volatile  uint8_t *)(0x42714030UL))
#define bFM4_MFS10_LIN_SCR_RIE                    *((volatile  uint8_t *)(0x42714030UL))
#define bFM_MFS10_LIN_SCR_LBR                     *((volatile  uint8_t *)(0x42714034UL))
#define bFM4_MFS10_LIN_SCR_LBR                    *((volatile  uint8_t *)(0x42714034UL))
#define bFM_MFS10_LIN_SCR_MS                      *((volatile  uint8_t *)(0x42714038UL))
#define bFM4_MFS10_LIN_SCR_MS                     *((volatile  uint8_t *)(0x42714038UL))
#define bFM_MFS10_LIN_SCR_UPCL                    *((volatile  uint8_t *)(0x4271403CUL))
#define bFM4_MFS10_LIN_SCR_UPCL                   *((volatile  uint8_t *)(0x4271403CUL))

#define bFM_MFS10_LIN_SMR_SOE                     *((volatile  uint8_t *)(0x42714000UL))
#define bFM4_MFS10_LIN_SMR_SOE                    *((volatile  uint8_t *)(0x42714000UL))
#define bFM_MFS10_LIN_SMR_SBL                     *((volatile  uint8_t *)(0x4271400CUL))
#define bFM4_MFS10_LIN_SMR_SBL                    *((volatile  uint8_t *)(0x4271400CUL))
#define bFM_MFS10_LIN_SMR_WUCR                    *((volatile  uint8_t *)(0x42714010UL))
#define bFM4_MFS10_LIN_SMR_WUCR                   *((volatile  uint8_t *)(0x42714010UL))

#define bFM_MFS10_LIN_SSR_TBI                     *((volatile  uint8_t *)(0x427140A0UL))
#define bFM4_MFS10_LIN_SSR_TBI                    *((volatile  uint8_t *)(0x427140A0UL))
#define bFM_MFS10_LIN_SSR_TDRE                    *((volatile  uint8_t *)(0x427140A4UL))
#define bFM4_MFS10_LIN_SSR_TDRE                   *((volatile  uint8_t *)(0x427140A4UL))
#define bFM_MFS10_LIN_SSR_RDRF                    *((volatile  uint8_t *)(0x427140A8UL))
#define bFM4_MFS10_LIN_SSR_RDRF                   *((volatile  uint8_t *)(0x427140A8UL))
#define bFM_MFS10_LIN_SSR_ORE                     *((volatile  uint8_t *)(0x427140ACUL))
#define bFM4_MFS10_LIN_SSR_ORE                    *((volatile  uint8_t *)(0x427140ACUL))
#define bFM_MFS10_LIN_SSR_FRE                     *((volatile  uint8_t *)(0x427140B0UL))
#define bFM4_MFS10_LIN_SSR_FRE                    *((volatile  uint8_t *)(0x427140B0UL))
#define bFM_MFS10_LIN_SSR_LBD                     *((volatile  uint8_t *)(0x427140B4UL))
#define bFM4_MFS10_LIN_SSR_LBD                    *((volatile  uint8_t *)(0x427140B4UL))
#define bFM_MFS10_LIN_SSR_REC                     *((volatile  uint8_t *)(0x427140BCUL))
#define bFM4_MFS10_LIN_SSR_REC                    *((volatile  uint8_t *)(0x427140BCUL))

#define bFM_MFS10_UART_BGR_EXT                    *((volatile  uint8_t *)(0x427141BCUL))
#define bFM4_MFS10_UART_BGR_EXT                   *((volatile  uint8_t *)(0x427141BCUL))

#define bFM_MFS10_UART_ESCR_P                     *((volatile  uint8_t *)(0x4271408CUL))
#define bFM4_MFS10_UART_ESCR_P                    *((volatile  uint8_t *)(0x4271408CUL))
#define bFM_MFS10_UART_ESCR_PEN                   *((volatile  uint8_t *)(0x42714090UL))
#define bFM4_MFS10_UART_ESCR_PEN                  *((volatile  uint8_t *)(0x42714090UL))
#define bFM_MFS10_UART_ESCR_INV                   *((volatile  uint8_t *)(0x42714094UL))
#define bFM4_MFS10_UART_ESCR_INV                  *((volatile  uint8_t *)(0x42714094UL))
#define bFM_MFS10_UART_ESCR_ESBL                  *((volatile  uint8_t *)(0x42714098UL))
#define bFM4_MFS10_UART_ESCR_ESBL                 *((volatile  uint8_t *)(0x42714098UL))
#define bFM_MFS10_UART_ESCR_FLWEN                 *((volatile  uint8_t *)(0x4271409CUL))
#define bFM4_MFS10_UART_ESCR_FLWEN                *((volatile  uint8_t *)(0x4271409CUL))

#define bFM_MFS10_UART_FCR_FE1                    *((volatile  uint8_t *)(0x42714280UL))
#define bFM4_MFS10_UART_FCR_FE1                   *((volatile  uint8_t *)(0x42714280UL))
#define bFM_MFS10_UART_FCR_FE2                    *((volatile  uint8_t *)(0x42714284UL))
#define bFM4_MFS10_UART_FCR_FE2                   *((volatile  uint8_t *)(0x42714284UL))
#define bFM_MFS10_UART_FCR_FCL1                   *((volatile  uint8_t *)(0x42714288UL))
#define bFM4_MFS10_UART_FCR_FCL1                  *((volatile  uint8_t *)(0x42714288UL))
#define bFM_MFS10_UART_FCR_FCL2                   *((volatile  uint8_t *)(0x4271428CUL))
#define bFM4_MFS10_UART_FCR_FCL2                  *((volatile  uint8_t *)(0x4271428CUL))
#define bFM_MFS10_UART_FCR_FSET                   *((volatile  uint8_t *)(0x42714290UL))
#define bFM4_MFS10_UART_FCR_FSET                  *((volatile  uint8_t *)(0x42714290UL))
#define bFM_MFS10_UART_FCR_FLD                    *((volatile  uint8_t *)(0x42714294UL))
#define bFM4_MFS10_UART_FCR_FLD                   *((volatile  uint8_t *)(0x42714294UL))
#define bFM_MFS10_UART_FCR_FLST                   *((volatile  uint8_t *)(0x42714298UL))
#define bFM4_MFS10_UART_FCR_FLST                  *((volatile  uint8_t *)(0x42714298UL))
#define bFM_MFS10_UART_FCR_FSEL                   *((volatile  uint8_t *)(0x427142A0UL))
#define bFM4_MFS10_UART_FCR_FSEL                  *((volatile  uint8_t *)(0x427142A0UL))
#define bFM_MFS10_UART_FCR_FTIE                   *((volatile  uint8_t *)(0x427142A4UL))
#define bFM4_MFS10_UART_FCR_FTIE                  *((volatile  uint8_t *)(0x427142A4UL))
#define bFM_MFS10_UART_FCR_FDRQ                   *((volatile  uint8_t *)(0x427142A8UL))
#define bFM4_MFS10_UART_FCR_FDRQ                  *((volatile  uint8_t *)(0x427142A8UL))
#define bFM_MFS10_UART_FCR_FRIIE                  *((volatile  uint8_t *)(0x427142ACUL))
#define bFM4_MFS10_UART_FCR_FRIIE                 *((volatile  uint8_t *)(0x427142ACUL))
#define bFM_MFS10_UART_FCR_FLSTE                  *((volatile  uint8_t *)(0x427142B0UL))
#define bFM4_MFS10_UART_FCR_FLSTE                 *((volatile  uint8_t *)(0x427142B0UL))

#define bFM_MFS10_UART_SCR_TXE                    *((volatile  uint8_t *)(0x42714020UL))
#define bFM4_MFS10_UART_SCR_TXE                   *((volatile  uint8_t *)(0x42714020UL))
#define bFM_MFS10_UART_SCR_RXE                    *((volatile  uint8_t *)(0x42714024UL))
#define bFM4_MFS10_UART_SCR_RXE                   *((volatile  uint8_t *)(0x42714024UL))
#define bFM_MFS10_UART_SCR_TBIE                   *((volatile  uint8_t *)(0x42714028UL))
#define bFM4_MFS10_UART_SCR_TBIE                  *((volatile  uint8_t *)(0x42714028UL))
#define bFM_MFS10_UART_SCR_TIE                    *((volatile  uint8_t *)(0x4271402CUL))
#define bFM4_MFS10_UART_SCR_TIE                   *((volatile  uint8_t *)(0x4271402CUL))
#define bFM_MFS10_UART_SCR_RIE                    *((volatile  uint8_t *)(0x42714030UL))
#define bFM4_MFS10_UART_SCR_RIE                   *((volatile  uint8_t *)(0x42714030UL))
#define bFM_MFS10_UART_SCR_UPCL                   *((volatile  uint8_t *)(0x4271403CUL))
#define bFM4_MFS10_UART_SCR_UPCL                  *((volatile  uint8_t *)(0x4271403CUL))

#define bFM_MFS10_UART_SMR_SOE                    *((volatile  uint8_t *)(0x42714000UL))
#define bFM4_MFS10_UART_SMR_SOE                   *((volatile  uint8_t *)(0x42714000UL))
#define bFM_MFS10_UART_SMR_BDS                    *((volatile  uint8_t *)(0x42714008UL))
#define bFM4_MFS10_UART_SMR_BDS                   *((volatile  uint8_t *)(0x42714008UL))
#define bFM_MFS10_UART_SMR_SBL                    *((volatile  uint8_t *)(0x4271400CUL))
#define bFM4_MFS10_UART_SMR_SBL                   *((volatile  uint8_t *)(0x4271400CUL))

#define bFM_MFS10_UART_SSR_TBI                    *((volatile  uint8_t *)(0x427140A0UL))
#define bFM4_MFS10_UART_SSR_TBI                   *((volatile  uint8_t *)(0x427140A0UL))
#define bFM_MFS10_UART_SSR_TDRE                   *((volatile  uint8_t *)(0x427140A4UL))
#define bFM4_MFS10_UART_SSR_TDRE                  *((volatile  uint8_t *)(0x427140A4UL))
#define bFM_MFS10_UART_SSR_RDRF                   *((volatile  uint8_t *)(0x427140A8UL))
#define bFM4_MFS10_UART_SSR_RDRF                  *((volatile  uint8_t *)(0x427140A8UL))
#define bFM_MFS10_UART_SSR_ORE                    *((volatile  uint8_t *)(0x427140ACUL))
#define bFM4_MFS10_UART_SSR_ORE                   *((volatile  uint8_t *)(0x427140ACUL))
#define bFM_MFS10_UART_SSR_FRE                    *((volatile  uint8_t *)(0x427140B0UL))
#define bFM4_MFS10_UART_SSR_FRE                   *((volatile  uint8_t *)(0x427140B0UL))
#define bFM_MFS10_UART_SSR_PE                     *((volatile  uint8_t *)(0x427140B4UL))
#define bFM4_MFS10_UART_SSR_PE                    *((volatile  uint8_t *)(0x427140B4UL))
#define bFM_MFS10_UART_SSR_REC                    *((volatile  uint8_t *)(0x427140BCUL))
#define bFM4_MFS10_UART_SSR_REC                   *((volatile  uint8_t *)(0x427140BCUL))


