rusefi/rusefi/firmware/config/boards/cypress/OS/os/common/ext/CMSIS/S6E2CxAH/s6e2c5xh.h
#define bFM_MFS12_UART_FCR_FE1                    *((volatile  uint8_t *)(0x42718280UL))
#define bFM4_MFS12_UART_FCR_FE1                   *((volatile  uint8_t *)(0x42718280UL))
#define bFM_MFS12_UART_FCR_FE2                    *((volatile  uint8_t *)(0x42718284UL))
#define bFM4_MFS12_UART_FCR_FE2                   *((volatile  uint8_t *)(0x42718284UL))
#define bFM_MFS12_UART_FCR_FCL1                   *((volatile  uint8_t *)(0x42718288UL))
#define bFM4_MFS12_UART_FCR_FCL1                  *((volatile  uint8_t *)(0x42718288UL))
#define bFM_MFS12_UART_FCR_FCL2                   *((volatile  uint8_t *)(0x4271828CUL))
#define bFM4_MFS12_UART_FCR_FCL2                  *((volatile  uint8_t *)(0x4271828CUL))
#define bFM_MFS12_UART_FCR_FSET                   *((volatile  uint8_t *)(0x42718290UL))
#define bFM4_MFS12_UART_FCR_FSET                  *((volatile  uint8_t *)(0x42718290UL))
#define bFM_MFS12_UART_FCR_FLD                    *((volatile  uint8_t *)(0x42718294UL))
#define bFM4_MFS12_UART_FCR_FLD                   *((volatile  uint8_t *)(0x42718294UL))
#define bFM_MFS12_UART_FCR_FLST                   *((volatile  uint8_t *)(0x42718298UL))
#define bFM4_MFS12_UART_FCR_FLST                  *((volatile  uint8_t *)(0x42718298UL))
#define bFM_MFS12_UART_FCR_FSEL                   *((volatile  uint8_t *)(0x427182A0UL))
#define bFM4_MFS12_UART_FCR_FSEL                  *((volatile  uint8_t *)(0x427182A0UL))
#define bFM_MFS12_UART_FCR_FTIE                   *((volatile  uint8_t *)(0x427182A4UL))
#define bFM4_MFS12_UART_FCR_FTIE                  *((volatile  uint8_t *)(0x427182A4UL))
#define bFM_MFS12_UART_FCR_FDRQ                   *((volatile  uint8_t *)(0x427182A8UL))
#define bFM4_MFS12_UART_FCR_FDRQ                  *((volatile  uint8_t *)(0x427182A8UL))
#define bFM_MFS12_UART_FCR_FRIIE                  *((volatile  uint8_t *)(0x427182ACUL))
#define bFM4_MFS12_UART_FCR_FRIIE                 *((volatile  uint8_t *)(0x427182ACUL))
#define bFM_MFS12_UART_FCR_FLSTE                  *((volatile  uint8_t *)(0x427182B0UL))
#define bFM4_MFS12_UART_FCR_FLSTE                 *((volatile  uint8_t *)(0x427182B0UL))

#define bFM_MFS12_UART_SCR_TXE                    *((volatile  uint8_t *)(0x42718020UL))
#define bFM4_MFS12_UART_SCR_TXE                   *((volatile  uint8_t *)(0x42718020UL))
#define bFM_MFS12_UART_SCR_RXE                    *((volatile  uint8_t *)(0x42718024UL))
#define bFM4_MFS12_UART_SCR_RXE                   *((volatile  uint8_t *)(0x42718024UL))
#define bFM_MFS12_UART_SCR_TBIE                   *((volatile  uint8_t *)(0x42718028UL))
#define bFM4_MFS12_UART_SCR_TBIE                  *((volatile  uint8_t *)(0x42718028UL))
#define bFM_MFS12_UART_SCR_TIE                    *((volatile  uint8_t *)(0x4271802CUL))
#define bFM4_MFS12_UART_SCR_TIE                   *((volatile  uint8_t *)(0x4271802CUL))
#define bFM_MFS12_UART_SCR_RIE                    *((volatile  uint8_t *)(0x42718030UL))
#define bFM4_MFS12_UART_SCR_RIE                   *((volatile  uint8_t *)(0x42718030UL))
#define bFM_MFS12_UART_SCR_UPCL                   *((volatile  uint8_t *)(0x4271803CUL))
#define bFM4_MFS12_UART_SCR_UPCL                  *((volatile  uint8_t *)(0x4271803CUL))

#define bFM_MFS12_UART_SMR_SOE                    *((volatile  uint8_t *)(0x42718000UL))
#define bFM4_MFS12_UART_SMR_SOE                   *((volatile  uint8_t *)(0x42718000UL))
#define bFM_MFS12_UART_SMR_BDS                    *((volatile  uint8_t *)(0x42718008UL))
#define bFM4_MFS12_UART_SMR_BDS                   *((volatile  uint8_t *)(0x42718008UL))
#define bFM_MFS12_UART_SMR_SBL                    *((volatile  uint8_t *)(0x4271800CUL))
#define bFM4_MFS12_UART_SMR_SBL                   *((volatile  uint8_t *)(0x4271800CUL))

#define bFM_MFS12_UART_SSR_TBI                    *((volatile  uint8_t *)(0x427180A0UL))
#define bFM4_MFS12_UART_SSR_TBI                   *((volatile  uint8_t *)(0x427180A0UL))
#define bFM_MFS12_UART_SSR_TDRE                   *((volatile  uint8_t *)(0x427180A4UL))
#define bFM4_MFS12_UART_SSR_TDRE                  *((volatile  uint8_t *)(0x427180A4UL))
#define bFM_MFS12_UART_SSR_RDRF                   *((volatile  uint8_t *)(0x427180A8UL))
#define bFM4_MFS12_UART_SSR_RDRF                  *((volatile  uint8_t *)(0x427180A8UL))
#define bFM_MFS12_UART_SSR_ORE                    *((volatile  uint8_t *)(0x427180ACUL))
#define bFM4_MFS12_UART_SSR_ORE                   *((volatile  uint8_t *)(0x427180ACUL))
#define bFM_MFS12_UART_SSR_FRE                    *((volatile  uint8_t *)(0x427180B0UL))
#define bFM4_MFS12_UART_SSR_FRE                   *((volatile  uint8_t *)(0x427180B0UL))
#define bFM_MFS12_UART_SSR_PE                     *((volatile  uint8_t *)(0x427180B4UL))
#define bFM4_MFS12_UART_SSR_PE                    *((volatile  uint8_t *)(0x427180B4UL))
#define bFM_MFS12_UART_SSR_REC                    *((volatile  uint8_t *)(0x427180BCUL))
#define bFM4_MFS12_UART_SSR_REC                   *((volatile  uint8_t *)(0x427180BCUL))


/*******************************************************************************
* MFS Registers MFS13
*   Bitband Section
*******************************************************************************/
#define bFM_MFS13_CSIO_ESCR_CSFE                  *((volatile  uint8_t *)(0x4271A094UL))
#define bFM4_MFS13_CSIO_ESCR_CSFE                 *((volatile  uint8_t *)(0x4271A094UL))
#define bFM_MFS13_CSIO_ESCR_L3                    *((volatile  uint8_t *)(0x4271A098UL))
#define bFM4_MFS13_CSIO_ESCR_L3                   *((volatile  uint8_t *)(0x4271A098UL))
#define bFM_MFS13_CSIO_ESCR_SOP                   *((volatile  uint8_t *)(0x4271A09CUL))
#define bFM4_MFS13_CSIO_ESCR_SOP                  *((volatile  uint8_t *)(0x4271A09CUL))

#define bFM_MFS13_CSIO_FCR_FE1                    *((volatile  uint8_t *)(0x4271A280UL))
#define bFM4_MFS13_CSIO_FCR_FE1                   *((volatile  uint8_t *)(0x4271A280UL))
#define bFM_MFS13_CSIO_FCR_FE2                    *((volatile  uint8_t *)(0x4271A284UL))
#define bFM4_MFS13_CSIO_FCR_FE2                   *((volatile  uint8_t *)(0x4271A284UL))
#define bFM_MFS13_CSIO_FCR_FCL1                   *((volatile  uint8_t *)(0x4271A288UL))
#define bFM4_MFS13_CSIO_FCR_FCL1                  *((volatile  uint8_t *)(0x4271A288UL))
#define bFM_MFS13_CSIO_FCR_FCL2                   *((volatile  uint8_t *)(0x4271A28CUL))
#define bFM4_MFS13_CSIO_FCR_FCL2                  *((volatile  uint8_t *)(0x4271A28CUL))
#define bFM_MFS13_CSIO_FCR_FSET                   *((volatile  uint8_t *)(0x4271A290UL))
#define bFM4_MFS13_CSIO_FCR_FSET                  *((volatile  uint8_t *)(0x4271A290UL))
#define bFM_MFS13_CSIO_FCR_FLD                    *((volatile  uint8_t *)(0x4271A294UL))
#define bFM4_MFS13_CSIO_FCR_FLD                   *((volatile  uint8_t *)(0x4271A294UL))
#define bFM_MFS13_CSIO_FCR_FLST                   *((volatile  uint8_t *)(0x4271A298UL))
#define bFM4_MFS13_CSIO_FCR_FLST                  *((volatile  uint8_t *)(0x4271A298UL))
#define bFM_MFS13_CSIO_FCR_FSEL                   *((volatile  uint8_t *)(0x4271A2A0UL))
#define bFM4_MFS13_CSIO_FCR_FSEL                  *((volatile  uint8_t *)(0x4271A2A0UL))
#define bFM_MFS13_CSIO_FCR_FTIE                   *((volatile  uint8_t *)(0x4271A2A4UL))
#define bFM4_MFS13_CSIO_FCR_FTIE                  *((volatile  uint8_t *)(0x4271A2A4UL))
#define bFM_MFS13_CSIO_FCR_FDRQ                   *((volatile  uint8_t *)(0x4271A2A8UL))
#define bFM4_MFS13_CSIO_FCR_FDRQ                  *((volatile  uint8_t *)(0x4271A2A8UL))
#define bFM_MFS13_CSIO_FCR_FRIIE                  *((volatile  uint8_t *)(0x4271A2ACUL))
#define bFM4_MFS13_CSIO_FCR_FRIIE                 *((volatile  uint8_t *)(0x4271A2ACUL))
#define bFM_MFS13_CSIO_FCR_FLSTE                  *((volatile  uint8_t *)(0x4271A2B0UL))
#define bFM4_MFS13_CSIO_FCR_FLSTE                 *((volatile  uint8_t *)(0x4271A2B0UL))

